
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第11章 去中心化應用 (DApps) · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="12.html" />
    
    
    <link rel="prev" href="10.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    精通以太坊
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="前言.html">
            
                <a href="前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="術語.html">
            
                <a href="術語.html">
            
                    
                    術語
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="01.html">
            
                <a href="01.html">
            
                    
                    第1章 什麼是以太坊
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="02.html">
            
                <a href="02.html">
            
                    
                    第2章 以太坊基礎
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="03.html">
            
                <a href="03.html">
            
                    
                    第3章 以太坊客戶端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="04.html">
            
                <a href="04.html">
            
                    
                    第4章 以太坊測試網（Testnets）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="05.html">
            
                <a href="05.html">
            
                    
                    第5章 密鑰、地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="06.html">
            
                <a href="06.html">
            
                    
                    第6章 錢包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="07.html">
            
                <a href="07.html">
            
                    
                    第7章 交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="08.html">
            
                <a href="08.html">
            
                    
                    第8章 智能合約
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="09.html">
            
                <a href="09.html">
            
                    
                    第9章 開發工具，框架和庫
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="10.html">
            
                <a href="10.html">
            
                    
                    第10章 Tokens
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="11.html">
            
                <a href="11.html">
            
                    
                    第11章 去中心化應用 (DApps)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="12.html">
            
                <a href="12.html">
            
                    
                    第12章 Oracles
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="13.html">
            
                <a href="13.html">
            
                    
                    第13章 gas（Gas）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="14.html">
            
                <a href="14.html">
            
                    
                    第14章 以太坊虛擬機
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="15.html">
            
                <a href="15.html">
            
                    
                    第15章 共識
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="16.html">
            
                <a href="16.html">
            
                    
                    第16章 Vyper: 面向合約的程式語言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="17.html">
            
                <a href="17.html">
            
                    
                    第17章 節點間的通信 —— 一個簡單的視角
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="18.html">
            
                <a href="18.html">
            
                    
                    第18章 以太坊標準
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="19.html">
            
                <a href="19.html">
            
                    
                    第19章 以太坊分叉歷史
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第11章 去中心化應用 (DApps)</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div class="sect1">
<h2 id="decentralized_applications_chap">&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x61C9;&#x7528; (DApps)</h2>
<div class="sectionbody">
<div class="paragraph">
<p>&#x9EDE;&#x5C0D;&#x9EDE;&#xFF08;P2P&#xFF0C;peer-to-peer&#xFF09;&#x904B;&#x52D5;&#x4F7F;&#x6578;&#x767E;&#x842C;&#x4E92;&#x806F;&#x7DB2;&#x7528;&#x6236;&#x80FD;&#x5920;&#x9023;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x3002;USENET&#x662F;&#x88AB;&#x7A31;&#x70BA;&#x7B2C;&#x4E00;&#x500B;&#x9EDE;&#x5C0D;&#x9EDE;&#x67B6;&#x69CB;&#x7684;&#x4E00;&#x7A2E;&#x5206;&#x4F48;&#x5F0F;&#x6D88;&#x606F;&#x50B3;&#x905E;&#x7CFB;&#x7D71;&#xFF0C;&#x5B83;&#x65BC;1979&#x5E74;&#x6210;&#x7ACB;&#xFF0C;&#x662F;&#x7B2C;&#x4E00;&#x500B;&#x201C;&#x4E92;&#x806F;&#x7DB2;&#x201D;ARPANET&#x7684;&#x7E7C;&#x627F;&#x8005;&#x3002;ARPANET&#x662F;&#x4E00;&#x500B;&#x5BA2;&#x6236;&#x7AEF; - &#x4F3A;&#x670D;&#x5668;&#x7DB2;&#x8DEF;&#xFF0C;&#x53C3;&#x8207;&#x8005;&#x904B;&#x884C;&#x7BC0;&#x9EDE;&#x8ACB;&#x6C42;&#x548C;&#x63D0;&#x4F9B;&#x5167;&#x5BB9;&#xFF0C;&#x4F46;&#x7531;&#x65BC;&#x9664;&#x4E86;&#x7C21;&#x55AE;&#x7684;&#x57FA;&#x65BC;&#x5730;&#x5740;&#x7684;&#x8DEF;&#x7531;&#xFF0C;&#x7F3A;&#x4E4F;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x80FD;&#x529B;&#xFF0C;USENET&#x5F88;&#x6709;&#x5E0C;&#x671B;&#x5BE6;&#x65BD;&#x4E00;&#x500B;&#x5206;&#x6563;&#x7684;&#x63A7;&#x5236;&#x6A21;&#x578B;&#xFF0C;&#x5373;&#x5BA2;&#x6236;&#x7AEF; - &#x4F3A;&#x670D;&#x5668;&#x6A21;&#x578B;&#xFF0C;&#x5206;&#x5225;&#x5F9E;&#x7528;&#x6236;&#x6216;&#x5BA2;&#x6236;&#x89D2;&#x5EA6;&#x70BA;&#x65B0;&#x805E;&#x7D44;&#x4F3A;&#x670D;&#x5668;&#x63D0;&#x4F9B;&#x81EA;&#x7D44;&#x7E54;&#x65B9;&#x6CD5;&#x3002;</p>
</div>
<div class="paragraph">
<p>1999&#x5E74;&#xFF0C;&#x8457;&#x540D;&#x7684;&#x97F3;&#x6A02;&#x548C;&#x6A94;&#x6848;&#x5171;&#x4EAB;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;Napster&#x51FA;&#x73FE;&#x4E86;&#x3002;Napster&#x662F;&#x9EDE;&#x5C0D;&#x9EDE;&#x7DB2;&#x8DEF;&#x904B;&#x52D5;&#x6F14;&#x8B8A;&#x70BA;BitTorrent&#x7684;&#x958B;&#x59CB;&#xFF0C;&#x53C3;&#x8207;&#x7528;&#x6236;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x500B;&#x865B;&#x64EC;&#x7DB2;&#x8DEF;&#xFF0C;&#x5B8C;&#x5168;&#x7368;&#x7ACB;&#x65BC;&#x7269;&#x7406;&#x7DB2;&#x8DEF;&#xFF0C;&#x7121;&#x9700;&#x9075;&#x5B88;&#x4EFB;&#x4F55;&#x7BA1;&#x7406;&#x6A5F;&#x69CB;&#x6216;&#x9650;&#x5236;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x7531;&#x65BC;&#x9EDE;&#x5C0D;&#x9EDE;&#x6A5F;&#x5236;&#x53EF;&#x7528;&#x65BC;&#x8A2A;&#x554F;&#x4EFB;&#x4F55;&#x985E;&#x578B;&#x7684;&#x5206;&#x4F48;&#x5F0F;&#x8CC7;&#x6E90;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x5011;&#x5728;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x4E2D;&#x8D77;&#x8457;&#x6838;&#x5FC3;&#x4F5C;&#x7528;&#x3002;</p>
</div>
<div class="sect2">
<h3 id="what_is_a_dapp_sec">&#x4EC0;&#x9EBC;&#x662F;DApp&#xFF1F;</h3>
<div class="paragraph">
<p>&#x8207;&#x50B3;&#x7D71;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x61C9;&#x7528;&#xFF08;DApp&#xFF09;&#x4E0D;&#x50C5;&#x5C6C;&#x65BC;&#x55AE;&#x500B;&#x63D0;&#x4F9B;&#x8005;&#x6216;&#x4F3A;&#x670D;&#x5668;&#xFF0C;&#x800C;&#x662F;&#x6574;&#x500B;&#x68E7;&#x5C07;&#x5728;P2P&#x7DB2;&#x8DEF;&#x4E0A;&#x4EE5;&#x5206;&#x4F48;&#x5F0F;&#x65B9;&#x5F0F;&#x90E8;&#x7F72;&#x548C;&#x64CD;&#x4F5C;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5178;&#x578B;&#x7684;DApp&#x68E7;&#x5305;&#x62EC;&#x524D;&#x7AEF;&#xFF0C;&#x5F8C;&#x7AEF;&#x548C;&#x6578;&#x64DA;&#x5132;&#x5B58;&#x3002;&#x5275;&#x5EFA;DApp&#x6709;&#x8A31;&#x591A;&#x512A;&#x9EDE;&#xFF0C;&#x5178;&#x578B;&#x96C6;&#x4E2D;&#x5F0F;&#x67B6;&#x69CB;&#x7121;&#x6CD5;&#x63D0;&#x4F9B;&#xFF1A;</p>
</div>
<div class="paragraph">
<p>1&#xFF09;&#x5F48;&#x6027;&#xFF1A;&#x5728;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x4E0A;&#x7DE8;&#x5BEB;&#x696D;&#x52D9;&#x908F;&#x8F2F;&#x610F;&#x5473;&#x8457;DApp&#x5F8C;&#x7AEF;&#x5C07;&#x5728;&#x5340;&#x584A;&#x93C8;&#x4E0A;&#x5B8C;&#x5168;&#x5206;&#x767C;&#x548C;&#x7BA1;&#x7406;&#x3002;&#x8207;&#x5728;&#x4E2D;&#x592E;&#x4F3A;&#x670D;&#x5668;&#x4E0A;&#x90E8;&#x7F72;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;DApp&#x4E0D;&#x6703;&#x6709;&#x505C;&#x6A5F;&#x6642;&#x9593;&#xFF0C;&#x53EA;&#x8981;&#x5340;&#x584A;&#x93C8;&#x4ECD;&#x5728;&#x904B;&#x884C;&#xFF0C;&#x5B83;&#x5C31;&#x6703;&#x7E7C;&#x7E8C;&#x5B58;&#x5728;&#x3002;</p>
</div>
<div class="paragraph">
<p>2&#xFF09;&#x900F;&#x660E;&#x6027;&#xFF1A;DApp&#x7684;&#x958B;&#x6E90;&#x7279;&#x6027;&#x5141;&#x8A31;&#x4EFB;&#x4F55;&#x4EBA;&#x5206;&#x53C9;&#x7A0B;&#x5F0F;&#x78BC;&#x4E26;&#x5728;&#x5340;&#x584A;&#x93C8;&#x4E0A;&#x904B;&#x884C;&#x76F8;&#x540C;&#x7684;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x3002;&#x540C;&#x6A23;&#xFF0C;&#x4EFB;&#x4F55;&#x8207;&#x5340;&#x584A;&#x93C8;&#x7684;&#x4E92;&#x52D5;&#x90FD;&#x5C07;&#x6C38;&#x4E45;&#x5132;&#x5B58;&#xFF0C;&#x4EFB;&#x4F55;&#x64C1;&#x6709;&#x5340;&#x584A;&#x93C8;&#x526F;&#x672C;&#x7684;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x7372;&#x5F97;&#x5C0D;&#x5B83;&#x7684;&#x8A2A;&#x554F;&#x6B0A;&#x9650;&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x53EF;&#x80FD;&#x7121;&#x6CD5;&#x5C07; Bytecode &#x53CD;&#x7DE8;&#x8B6F;&#x70BA;&#x6E90;&#x78BC;&#x4E26;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x5408;&#x7D04;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;&#x5C0B;&#x6C42;&#x63D0;&#x4F9B;&#x5408;&#x7D04;&#x884C;&#x70BA;&#x5B8C;&#x5168;&#x900F;&#x660E;&#x7684;&#x958B;&#x767C;&#x4EBA;&#x54E1;&#x5FC5;&#x9808;&#x767C;&#x4F48;&#x4F9B;&#x7528;&#x6236;&#x95B1;&#x8B80;&#xFF0C;&#x7DE8;&#x8B6F;&#x548C;&#x9A57;&#x8B49;&#x7684;&#x6E90;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;</p>
</div>
<div class="paragraph">
<p>3&#xFF09;&#x6297;&#x5BE9;&#x67E5;&#xFF1A;&#x53EA;&#x8981;&#x7528;&#x6236;&#x53EF;&#x4EE5;&#x8A2A;&#x554F;&#x4EE5;&#x592A;&#x574A;&#x7BC0;&#x9EDE;&#xFF0C;&#x7528;&#x6236;&#x5C07;&#x59CB;&#x7D42;&#x80FD;&#x5920;&#x8207;DApp&#x4EA4;&#x4E92;&#x800C;&#x4E0D;&#x53D7;&#x96C6;&#x4E2D;&#x6A5F;&#x69CB;&#x63A7;&#x5236;&#x7684;&#x5E72;&#x64FE;&#x3002;&#x4E00;&#x65E6;&#x5728;&#x7DB2;&#x8DEF;&#x4E0A;&#x90E8;&#x7F72;&#x7A0B;&#x5F0F;&#x78BC;&#xFF0C;&#x4EFB;&#x4F55;&#x670D;&#x52D9;&#x63D0;&#x4F9B;&#x5546;&#xFF0C;&#x751A;&#x81F3;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x7684;&#x6240;&#x6709;&#x8005;&#x90FD;&#x4E0D;&#x80FD;&#x66F4;&#x6539;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="components_of_a_dapp_sec">DApp&#x7684;&#x7D44;&#x4EF6;</h3>
<div class="sect3">
<h4 id="blockchain_smart_contracts_sec">&#x5340;&#x584A;&#x93C8;&#xFF08;&#x667A;&#x80FD;&#x5408;&#x7D04;&#xFF09;</h4>
<div class="paragraph">
<p>&#x667A;&#x80FD;&#x5408;&#x7D04;&#x7528;&#x65BC;&#x5132;&#x5B58;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x7684;&#x696D;&#x52D9;&#x908F;&#x8F2F;&#xFF0C;&#x72C0;&#x614B;&#x548C;&#x8A08;&#x7B97;; &#x5C07;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x8996;&#x70BA;&#x5E38;&#x898F;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x4E2D;&#x7684;&#x4F3A;&#x670D;&#x5668;&#x7AEF;&#x7D44;&#x4EF6;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5728;&#x4EE5;&#x592A;&#x574A;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x4E0A;&#x90E8;&#x7F72;&#x4F3A;&#x670D;&#x5668;&#x7AEF;&#x908F;&#x8F2F;&#x7684;&#x4E00;&#x500B;&#x512A;&#x9EDE;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x69CB;&#x5EFA;&#x4E00;&#x500B;&#x66F4;&#x5FA9;&#x96DC;&#x7684;&#x67B6;&#x69CB;&#xFF0C;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4E2D;&#x76F8;&#x4E92;&#x8B80;&#x53D6;&#x548C;&#x5BEB;&#x5165;&#x6578;&#x64DA;&#x3002;&#x90E8;&#x7F72;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x5F8C;&#xFF0C;&#x672A;&#x4F86;&#x8A31;&#x591A;&#x5176;&#x4ED6;&#x958B;&#x767C;&#x4EBA;&#x54E1;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4F60;&#x7684;&#x696D;&#x52D9;&#x908F;&#x8F2F;&#xFF0C;&#x800C;&#x7121;&#x9700;&#x4F60;&#x7BA1;&#x7406;&#x548C;&#x7DAD;&#x8B77;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5C07;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x4F5C;&#x70BA;&#x6838;&#x5FC3;&#x696D;&#x52D9;&#x908F;&#x8F2F;&#x529F;&#x80FD;&#x904B;&#x884C;&#x7684;&#x4E00;&#x500B;&#x4E3B;&#x8981;&#x554F;&#x984C;&#x662F;&#x5728;&#x90E8;&#x7F72;&#x7A0B;&#x5F0F;&#x78BC;&#x5F8C;&#x7121;&#x6CD5;&#x66F4;&#x6539;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E00;&#x500B;&#x975E;&#x5E38;&#x9F90;&#x5927;&#x7684;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8017;&#x8CBB;&#x5927;&#x91CF;gas&#x4F86;&#x90E8;&#x7F72;&#x548C;&#x904B;&#x884C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x67D0;&#x4E9B;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x53EF;&#x80FD;&#x6703;&#x9078;&#x64C7;&#x96E2;&#x7DDA;&#x8A08;&#x7B97;&#x548C;&#x5916;&#x90E8;&#x6578;&#x64DA;&#x6E90;&#x3002;&#x8ACB;&#x8A18;&#x4F4F;&#xFF0C;DApp&#x7684;&#x6838;&#x5FC3;&#x696D;&#x52D9;&#x908F;&#x8F2F;&#x4F9D;&#x8CF4;&#x65BC;&#x5916;&#x90E8;&#x6578;&#x64DA;&#x6216;&#x4F3A;&#x670D;&#x5668;&#x610F;&#x5473;&#x8457;&#x4F60;&#x7684;&#x7528;&#x6236;&#x5FC5;&#x9808;&#x4FE1;&#x4EFB;&#x9019;&#x4E9B;&#x5916;&#x90E8;&#x4E8B;&#x7269;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="front_end_web_ui_cec">&#x524D;&#x7AEF;&#xFF08;Web&#x7528;&#x6236;&#x754C;&#x9762;(UI)&#xFF09;</h4>
<div class="paragraph">
<p>&#x8207;DApp&#x7684;&#x696D;&#x52D9;&#x908F;&#x8F2F;&#x9700;&#x8981;&#x958B;&#x767C;&#x4EBA;&#x54E1;&#x77AD;&#x89E3;EVM&#x548C;&#x65B0;&#x8A9E;&#x8A00;&#xFF08;&#x5982;Solidity&#xFF09;&#x4E0D;&#x540C;&#xFF0C;DApp&#x7684;&#x5BA2;&#x6236;&#x7AEF;&#x754C;&#x9762;&#x4F7F;&#x7528;&#x57FA;&#x672C;&#x7684;Web&#x524D;&#x7AEF;&#x6280;&#x8853;&#xFF08;HTML&#xFF0C;CSS&#xFF0C;JavaScript&#xFF09;&#x3002;&#x9019;&#x5141;&#x8A31;&#x50B3;&#x7D71;&#x7684;Web&#x958B;&#x767C;&#x4EBA;&#x54E1;&#x4F7F;&#x7528;&#x4ED6;&#x5011;&#x719F;&#x6089;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5EAB;&#x548C;&#x6846;&#x67B6;&#x3002;&#x8207;DApp&#x7684;&#x4EA4;&#x4E92;&#xFF08;&#x4F8B;&#x5982;&#x7C3D;&#x540D;&#x6D88;&#x606F;&#xFF0C;&#x767C;&#x9001;&#x4EA4;&#x6613;&#x548C;&#x5BC6;&#x9470;&#x7BA1;&#x7406;&#xFF09;&#x901A;&#x5E38;&#x901A;&#x904E;&#x700F;&#x89BD;&#x5668;&#x672C;&#x8EAB;&#x4F7F;&#x7528;Mist&#x700F;&#x89BD;&#x5668;&#x6216;Metamask&#x700F;&#x89BD;&#x5668;&#x64F4;&#x5C55;&#x7B49;&#x5DE5;&#x5177;&#x9032;&#x884C;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x96D6;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x5275;&#x5EFA;&#x884C;&#x52D5;DApp&#xFF0C;&#x4F46;&#x7531;&#x65BC;&#x7F3A;&#x5C11;&#x53EF;&#x7528;&#x4F5C;&#x5177;&#x6709;&#x5BC6;&#x9470;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#x7684;&#x8F15;&#x5BA2;&#x6236;&#x7AEF;&#x7684;&#x884C;&#x52D5;&#x5BA2;&#x6236;&#x7AEF;&#xFF0C;&#x76EE;&#x524D;&#x6C92;&#x6709;&#x5275;&#x5EFA;&#x884C;&#x52D5;DApp&#x524D;&#x7AEF;&#x7684;&#x6700;&#x4F73;&#x5BE6;&#x8E10;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="data_storage_sec">&#x6578;&#x64DA;&#x5132;&#x5B58;</h4>
<div class="paragraph">
<p>&#x7531;&#x65BC;gas&#x6210;&#x672C;&#x9AD8;&#xFF0C;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x76EE;&#x524D;&#x4E0D;&#x9069;&#x5408;&#x5132;&#x5B58;&#x5927;&#x91CF;&#x6578;&#x64DA;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5927;&#x591A;&#x6578;DApps&#x5C07;&#x5229;&#x7528;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5132;&#x5B58;&#xFF08;&#x5982;IPFS&#x6216;Swarm&#xFF09;&#x4F86;&#x5132;&#x5B58;&#x548C;&#x5206;&#x767C;&#x5927;&#x578B;&#x975C;&#x614B;&#x8CC7;&#x7522;&#xFF0C;&#x5982;&#x5716;&#x50CF;&#xFF0C;&#x8996;&#x983B;&#x548C;&#x5BA2;&#x6236;&#x7AEF;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#xFF08;HTML&#xFF0C;CSS&#xFF0C;JavaScript&#xFF09;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5167;&#x5BB9;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x9375;&#x503C;&#x6620;&#x5C04;&#x5132;&#x5B58;&#x70BA;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x4E2D;&#x7684;&#x5B57;&#x7BC0;&#x3002;&#x7136;&#x5F8C;&#xFF0C;&#x901A;&#x904E;&#x4F60;&#x7684;&#x524D;&#x7AEF;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x8ABF;&#x7528;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x67E5;&#x8A62;&#x8CC7;&#x7522;&#xFF0C;&#x4EE5;&#x7372;&#x53D6;&#x6BCF;&#x500B;&#x8CC7;&#x7522;&#x7684;URL&#x3002;</p>
</div>
<div class="sect4">
<h5 id="on_chain_vs_off_chain_data_sec">&#x4E0A;&#x93C8; vs. &#x812B;&#x93C8;</h5>

</div>
<div class="sect4">
<h5 id="ipfs_sec">IPFS</h5>

</div>
<div class="sect4">
<h5 id="swarm_sec">Swarm</h5>
<div class="paragraph">
<p>Swarm&#x4E3B;&#x9801;: <a href="http://swarm-gateways.net/bzz:/theswarm.eth/" class="bare" target="_blank">http://swarm-gateways.net/bzz:/theswarm.eth/</a></p>
</div>
<div class="paragraph">
<p>&#x95B1;&#x8B80;&#x6587;&#x4EF6;: <a href="https://swarm-guide.readthedocs.io/en/latest/index.html" class="bare" target="_blank">https://swarm-guide.readthedocs.io/en/latest/index.html</a></p>
</div>
<div class="paragraph">
<p>Swarm&#x958B;&#x767C;&#x4EBA;&#x54E1;&#x7684;&#x5165;&#x9580;&#x6307;&#x5357;: <a href="https://github.com/ethersphere/swarm/wiki/swarm" class="bare" target="_blank">https://github.com/ethersphere/swarm/wiki/swarm</a></p>
</div>
<div class="paragraph">
<p>Swarm&#x8A0E;&#x8AD6;&#x7D44;: <a href="https://gitter.im/ethersphere/orange-lounge" class="bare" target="_blank">https://gitter.im/ethersphere/orange-lounge</a></p>
</div>
<div class="paragraph">
<p>Ethereum&#x2019;s Swarm &#x548C; IPFS &#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x8655;&#x8207;&#x4E0D;&#x540C;&#x4E4B;&#x8655;; <a href="https://github.com/ethersphere/go-ethereum/wiki/IPFS-&amp;-SWARM" class="bare" target="_blank">https://github.com/ethersphere/go-ethereum/wiki/IPFS-&amp;-SWARM</a></p>
</div>
</div>
<div class="sect4">
<h5 id="centralized_db_sec">&#x4E2D;&#x5FC3;&#x5316;&#x6578;&#x64DA;</h5>
<div class="paragraph">
<p>&#x96C6;&#x4E2D;&#x5F0F;&#x8CC7;&#x6599;&#x5EAB;&#x662F;&#x4F3A;&#x670D;&#x5668;&#x4E0A;&#x7684;&#x6578;&#x64DA;&#x5132;&#x5B58;&#xFF0C;&#x5176;&#x7279;&#x5FB5;&#x8207;&#x63CF;&#x8FF0;&#x76F8;&#x95DC;&#x806F;&#x3002;&#x5B83;&#x5011;&#x4F7F;&#x7528;&#x5BA2;&#x6236;&#x7AEF; - &#x4F3A;&#x670D;&#x5668;&#x7DB2;&#x8DEF;&#x67B6;&#x69CB;&#xFF0C;&#x9019;&#x5141;&#x8A31;&#x5BA2;&#x6236;&#x7AEF;&#x6216;&#x7528;&#x6236;&#x4FEE;&#x6539;&#x5132;&#x5B58;&#x5728;&#x96C6;&#x4E2D;&#x5F0F;&#x4F3A;&#x670D;&#x5668;&#x4E0A;&#x7684;&#x6578;&#x64DA;&#x3002;&#x8CC7;&#x6599;&#x5EAB;&#x7684;&#x63A7;&#x5236;&#x6B0A;&#x4ECD;&#x7531;&#x6307;&#x5B9A;&#x7684;&#x7BA1;&#x7406;&#x54E1;&#x9032;&#x884C;&#xFF0C;&#x7BA1;&#x7406;&#x54E1;&#x5728;&#x63D0;&#x4F9B;&#x5C0D;&#x8CC7;&#x6599;&#x5EAB;&#x7684;&#x8A2A;&#x554F;&#x4E4B;&#x524D;&#x5C0D;&#x5BA2;&#x6236;&#x7AEF;&#x7684;&#x6191;&#x64DA;&#x9032;&#x884C;&#x8EAB;&#x4EFD;&#x9A57;&#x8B49;&#x3002;&#x5982;&#x679C;&#x7BA1;&#x7406;&#x54E1;&#x7684;&#x5B89;&#x5168;&#x6027;&#x53D7;&#x5230;&#x640D;&#x5BB3;&#xFF0C;&#x5247;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x751A;&#x81F3;&#x522A;&#x9664;&#x6578;&#x64DA;&#xFF0C;&#x56E0;&#x70BA;&#x7BA1;&#x7406;&#x54E1;&#x662F;&#x552F;&#x4E00;&#x8CA0;&#x8CAC;&#x7BA1;&#x7406;&#x8CC7;&#x6599;&#x5EAB;&#x7684;&#x4EBA;&#x3002;</p>
</div>
</div>
</div>
</div>
<div class="sect2">
<h3 id="dapp_frameworks_sec">DApp&#x6846;&#x67B6;</h3>
<div class="paragraph">
<p>&#x6709;&#x8A31;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x958B;&#x767C;&#x6846;&#x67B6;&#x548C;&#x5EAB;&#xFF0C;&#x4EE5;&#x591A;&#x7A2E;&#x8A9E;&#x8A00;&#x7DE8;&#x5BEB;&#xFF0C;&#x4F7F;&#x5F97;&#x958B;&#x767C;&#x4EBA;&#x54E1;&#x53EF;&#x4EE5;&#x5728;&#x5275;&#x5EFA;&#x548C;&#x90E8;&#x7F72;DApp&#x6642;&#x7372;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x9AD4;&#x9A57;&#x3002;</p>
</div>
<div class="sect3">
<h4 id="truffle_sec">Truffle</h4>
<div class="paragraph">
<p>Truffle&#x662F;&#x4E00;&#x7A2E;&#x6D41;&#x884C;&#x7684;&#x9078;&#x64C7;&#xFF0C;&#x70BA;&#x4EE5;&#x592A;&#x574A;&#x63D0;&#x4F9B;&#x53EF;&#x7BA1;&#x7406;&#x7684;&#x958B;&#x767C;&#x74B0;&#x5883;&#xFF0C;&#x6E2C;&#x8A66;&#x6846;&#x67B6;&#x548C;&#x8CC7;&#x7522;&#x7BA1;&#x9053;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x6709;&#x4E86;Truffle&#xFF0C;&#x4F60;&#x6703;&#x5F97;&#x5230;&#xFF1A;</p>
</div>
<div class="ulist">
<ul>
<li>
<p>&#x5167;&#x5EFA;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x7DE8;&#x8B6F;&#xFF0C;&#x93C8;&#x63A5;&#xFF0C;&#x90E8;&#x7F72;&#x548C;&#x4E8C;&#x9032;&#x5236;&#x7BA1;&#x7406;&#x3002;</p>
</li>
<li>
<p>&#x8207;Mocha&#x548C;Chai&#x9032;&#x884C;&#x81EA;&#x52D5;&#x5408;&#x7D04;&#x6E2C;&#x8A66;&#x3002;</p>
</li>
<li>
<p>&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x69CB;&#x5EFA;&#x7BA1;&#x9053;&#xFF0C;&#x652F;&#x6301;&#x81EA;&#x5B9A;&#x7FA9;&#x69CB;&#x5EFA;&#x904E;&#x7A0B;&#x3002;</p>
</li>
<li>
<p>&#x53EF;&#x7DE8;&#x5BEB;&#x8173;&#x672C;&#x7684;&#x90E8;&#x7F72;&#x548C;&#x9077;&#x79FB;&#x6846;&#x67B6;&#x3002;</p>
</li>
<li>
<p>&#x7528;&#x65BC;&#x90E8;&#x7F72;&#x5230;&#x8A31;&#x591A;&#x516C;&#x5171;&#x548C;&#x5C08;&#x7528;&#x7DB2;&#x8DEF;&#x7684;&#x7DB2;&#x8DEF;&#x7BA1;&#x7406;&#x3002;</p>
</li>
<li>
<p>&#x76F4;&#x63A5;&#x8207;&#x5408;&#x7D04;&#x6E9D;&#x901A;&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x63A7;&#x5236;&#x53F0;&#x3002;</p>
</li>
<li>
<p>&#x5728;&#x958B;&#x767C;&#x904E;&#x7A0B;&#x4E2D;&#x5373;&#x6642;&#x91CD;&#x5EFA;&#x8CC7;&#x7522;&#x3002;</p>
</li>
<li>
<p>&#x5728;Truffle&#x74B0;&#x5883;&#x4E2D;&#x57F7;&#x884C;&#x8173;&#x672C;&#x7684;&#x5916;&#x90E8;&#x8173;&#x672C;&#x904B;&#x884C;&#x5668;&#x3002;</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>&#x5165;&#x9580;&#x548C;&#x6587;&#x4EF6;&#xFF1A;http://truffleframework.com/docs</p>
</div>
<div class="paragraph">
<p>Github&#xFF1A;https://github.com/trufflesuite/truffle</p>
</div>
<div class="paragraph">
<p>Website&#xFF1A;https://truffleframework.com</p>
</div>
</div>
<div class="sect3">
<h4 id="embark_sec">Embark Embark&#x6846;&#x67B6;&#x5C08;&#x6CE8;&#x65BC;&#x4F7F;&#x7528;&#x4EE5;&#x592A;&#x574A;&#xFF0C;IPFS&#x548C;&#x5176;&#x4ED6;&#x5E73;&#x81FA;&#x7684;&#x7121;&#x4F3A;&#x670D;&#x5668;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x61C9;&#x7528;&#x3002;Embark&#x76EE;&#x524D;&#x8207;EVM&#x5340;&#x584A;&#x93C8;&#xFF08;Ethereum&#xFF09;&#xFF0C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5132;&#x5B58;&#xFF08;IPFS&#xFF09;&#x548C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x901A;&#x4FE1;&#x5E73;&#x81FA;&#xFF08;Whisper&#x548C;Orbit&#xFF09;&#x96C6;&#x6210;&#x3002;</h4>
<div class="ulist">
<ul>
<li>
<p>&#x5340;&#x584A;&#x93C8;&#xFF08;&#x4EE5;&#x592A;&#x574A;&#xFF09;</p>
<div class="ulist">
<ul>
<li>
<p>&#x81EA;&#x52D5;&#x90E8;&#x7F72;&#x5408;&#x7D04;&#x4E26;&#x4F7F;&#x5176;&#x5728;JS&#x7A0B;&#x5F0F;&#x78BC;&#x4E2D;&#x53EF;&#x7528;&#x3002;&#x555F;&#x52D5;&#x76E3;&#x8996;&#x66F4;&#x6539;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x66F4;&#x65B0;&#x5408;&#x7D04;&#xFF0C;Embark&#x5C07;&#x81EA;&#x52D5;&#x91CD;&#x65B0;&#x90E8;&#x7F72;&#x5408;&#x7D04;&#xFF08;&#x5982;&#x679C;&#x9700;&#x8981;&#xFF09;&#x548C;DApp&#x3002;</p>
</li>
<li>
<p>JS&#x901A;&#x904E;Promises&#x4F7F;&#x7528;&#x5408;&#x7D04;&#x3002;</p>
</li>
<li>
<p>&#x4F7F;&#x7528;Javascript&#x8207;&#x5408;&#x7D04;&#x9032;&#x884C;&#x6E2C;&#x8A66;&#x9A45;&#x52D5;&#x958B;&#x767C;&#x3002;</p>
</li>
<li>
<p>&#x8DDF;&#x8E64;&#x5DF2;&#x90E8;&#x7F72;&#x7684;&#x5408;&#x7D04;; &#x53EA;&#x5728;&#x771F;&#x6B63;&#x9700;&#x8981;&#x6642;&#x90E8;&#x7F72;&#x3002;</p>
</li>
<li>
<p>&#x7BA1;&#x7406;&#x4E0D;&#x540C;&#x7684;&#x93C8;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6E2C;&#x8A66;&#x7DB2;&#xFF0C;&#x79C1;&#x4EBA;&#x7DB2;&#xFF0C;livenet&#xFF09;</p>
</li>
<li>
<p>&#x8F15;&#x9B06;&#x7BA1;&#x7406;&#x76F8;&#x4E92;&#x4F9D;&#x8CF4;&#x5408;&#x7D04;&#x7684;&#x8907;&#x96DC;&#x7CFB;&#x7D71;&#x3002;</p>
</li>
</ul>
</div>
</li>
<li>
<p>&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5132;&#x5B58;&#xFF08;IPFS&#xFF09;</p>
<div class="ulist">
<ul>
<li>
<p>&#x901A;&#x904E;EmbarkJS&#x8F15;&#x9B06;&#x5132;&#x5B58;&#x548C;&#x67E5;&#x8A62;DApp&#x4E0A;&#x7684;&#x6578;&#x64DA;&#xFF0C;&#x5305;&#x62EC;&#x4E0A;&#x50B3;&#x548C;&#x67E5;&#x8A62;&#x6A94;&#x6848;&#x3002;</p>
</li>
<li>
<p>&#x5C07;&#x5B8C;&#x6574;&#x7684;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x90E8;&#x7F72;&#x5230;IPFS&#x6216;Swarm&#x3002;</p>
</li>
</ul>
</div>
</li>
<li>
<p>&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x901A;&#x4FE1; (Whisper, Orbit)</p>
<div class="ulist">
<ul>
<li>
<p>&#x901A;&#x904E;Whisper&#x6216;Orbit&#x8F15;&#x9B06;&#x901A;&#x904E;P2P&#x6E20;&#x9053;&#x767C;&#x9001;/&#x63A5;&#x6536;&#x6D88;&#x606F;&#x3002;</p>
</li>
</ul>
</div>
</li>
<li>
<p>&#x7DB2;&#x8DEF;&#x6280;&#x8853;</p>
<div class="ulist">
<ul>
<li>
<p>&#x8207;&#x4EFB;&#x4F55;&#x7DB2;&#x8DEF;&#x6280;&#x8853;&#x96C6;&#x6210;&#xFF0C;&#x5305;&#x62EC;React&#xFF0C;Foundation&#x7B49;&#x3002;</p>
</li>
<li>
<p>&#x4F7F;&#x7528;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x4EFB;&#x4F55;&#x69CB;&#x5EFA;&#x7BA1;&#x9053;&#x6216;&#x5DE5;&#x5177;&#xFF0C;&#x5305;&#x62EC;grunt&#xFF0C;gulp&#x548C;webpack&#x3002;</p>
</li>
</ul>
</div>
</li>
</ul>
</div>
<div class="paragraph">
<p>&#x5165;&#x9580;&#x548C;&#x6587;&#x4EF6;&#xFF1A;https://embark.readthedocs.io</p>
</div>
<div class="paragraph">
<p>Github&#xFF1A;https://github.com/embark-framework/embark</p>
</div>
<div class="paragraph">
<p>Website&#xFF1A;https://github.com/embark-framework/embark</p>
</div>
</div>
<div class="sect3">
<h4 id="_emerald">Emerald</h4>
<div class="paragraph">
<p>Emerald Platform &#x662F;&#x4E00;&#x500B;&#x6846;&#x67B6;&#x548C;&#x5DE5;&#x5177;&#x96C6;&#xFF0C;&#x7528;&#x65BC;&#x7C21;&#x5316;Dapps&#x7684;&#x958B;&#x767C;&#x4EE5;&#x53CA;&#x73FE;&#x6709;&#x670D;&#x52D9;&#x8207;&#x57FA;&#x65BC;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x5340;&#x584A;&#x93C8;&#x7684;&#x96C6;&#x6210;&#x3002;</p>
</div>
<div class="paragraph">
<p>Emerald&#x63D0;&#x4F9B;&#xFF1A;</p>
</div>
<div class="ulist">
<ul>
<li>
<p>Javascript&#x5EAB;&#x548C;React&#x7D44;&#x4EF6;&#x69CB;&#x5EFA;Dapp</p>
</li>
<li>
<p>&#x5340;&#x584A;&#x93C8;&#x9805;&#x76EE;&#x5E38;&#x898B;&#x7684;SVG&#x5716;&#x793A;</p>
</li>
<li>
<p>&#x7528;&#x65BC;&#x7BA1;&#x7406;&#x79C1;&#x9470;&#x7684;Rust&#x5EAB;&#xFF0C;&#x5305;&#x62EC;&#x786C;&#x9AD4;&#x9322;&#x5305;&#x548C;&#x7C3D;&#x540D;&#x4EA4;&#x6613;</p>
</li>
<li>
<p>&#x53EF;&#x4EE5;&#x96C6;&#x6210;&#x5230;&#x73FE;&#x6709;app&#x547D;&#x4EE4;&#x884C;&#x6216;JSON RPC API&#x4E2D;&#x7684;&#x73FE;&#x6210;&#x7684;&#x7D44;&#x4EF6;&#x548C;&#x670D;&#x52D9;</p>
</li>
<li>
<p>SputnikVM&#xFF0C;&#x4E00;&#x500B;&#x7368;&#x7ACB;&#x7684;EVM&#x5BE6;&#x73FE;&#xFF0C;&#x53EF;&#x7528;&#x65BC;&#x958B;&#x767C;&#x548C;&#x6E2C;&#x8A66;</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>&#x5B83;&#x8207;&#x5E73;&#x81FA;&#x7121;&#x95DC;&#xFF0C;&#x70BA;&#x5404;&#x7A2E;&#x76EE;&#x6A19;&#x63D0;&#x4F9B;&#x5DE5;&#x5177;&#xFF1A;</p>
</div>
<div class="ulist">
<ul>
<li>
<p>&#x8207;Electron&#x6346;&#x7D81;&#x7684;&#x684C;&#x9762;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;</p>
</li>
<li>
<p>&#x884C;&#x52D5;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;</p>
</li>
<li>
<p>&#x7DB2;&#x8DEF;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;</p>
</li>
<li>
<p>&#x547D;&#x4EE4;&#x884C;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x548C;&#x8173;&#x672C;&#x5DE5;&#x5177;</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>&#x5165;&#x9580;&#x548C;&#x6587;&#x4EF6;&#xFF1A;https://docs.etcdevteam.com</p>
</div>
<div class="paragraph">
<p>Github&#xFF1A;https://github.com/etcdevteam/emerald-platform</p>
</div>
<div class="paragraph">
<p>Website&#xFF1A;https://emeraldplatform.io</p>
</div>
<div class="paragraph">
<p>[[dapp_develotment_tool_sec]
==== DApp&#xFF08;&#x958B;&#x767C;&#x5DE5;&#x5177;&#xFF09;
DApp&#x662F;&#x4E00;&#x500B;&#x7528;&#x65BC;&#x667A;&#x80FD;&#x5408;&#x7D04;&#x958B;&#x767C;&#x7684;&#x7C21;&#x55AE;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#x3002;&#x5B83;&#x652F;&#x6301;&#x4EE5;&#x4E0B;&#x5E38;&#x898B;&#x7528;&#x4F8B;&#xFF1A;</p>
</div>
<div class="ulist">
<ul>
<li>
<p>&#x5305;&#x7BA1;&#x7406;</p>
</li>
<li>
<p>&#x6E90;&#x7A0B;&#x5F0F;&#x78BC;&#x69CB;&#x5EFA;</p>
</li>
<li>
<p>&#x55AE;&#x5143;&#x6E2C;&#x8A66;</p>
</li>
<li>
<p>&#x7C21;&#x55AE;&#x7684;&#x5408;&#x7D04;&#x90E8;&#x7F72;</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>&#x5165;&#x9580;&#x548C;&#x6587;&#x4EF6;&#xFF1A;https://dapp.readthedocs.io/en/latest/</p>
</div>
</div>
</div>
<div class="sect2">
<h3 id="live_dapps_sec">&#x6D3B;&#x8E8D;&#x7684;DApps</h3>
<div class="paragraph">
<p>&#x4EE5;&#x4E0B;&#x5217;&#x51FA;&#x4E86;&#x4EE5;&#x592A;&#x574A;&#x7DB2;&#x8DEF;&#x4E0A;&#x7684;&#x6D3B;&#x8E8D;DApp&#xFF1A;</p>
</div>
<div class="sect3">
<h4 id="ethpm_sec">EthPM</h4>
<div class="paragraph">
<p>&#x4E00;&#x500B;&#x65E8;&#x5728;&#x5C07;&#x5305;&#x7BA1;&#x7406;&#x5E36;&#x5165;&#x4EE5;&#x592A;&#x574A;&#x751F;&#x614B;&#x7CFB;&#x7D71;&#x7684;&#x9805;&#x76EE;&#x3002;</p>
</div>
<div class="paragraph">
<p>Website&#xFF1A;https://www.ethpm.com/</p>
</div>
</div>
<div class="sect3">
<h4 id="radar_relay_sec">Radar Relay</h4>
<div class="paragraph">
<p>DEX&#xFF08;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x4EA4;&#x6613;&#x6240;&#xFF09;&#x5C08;&#x6CE8;&#x65BC;&#x76F4;&#x63A5;&#x5F9E;&#x9322;&#x5305;&#x5230;&#x9322;&#x5305;&#x4EA4;&#x6613;&#x57FA;&#x65BC;&#x4EE5;&#x592A;&#x574A;&#x7684;tokens&#x3002;</p>
</div>
<div class="paragraph">
<p>Website&#xFF1A;https://radarrelay.com/</p>
</div>
</div>
<div class="sect3">
<h4 id="cryptokitties_sec">CryptoKitties</h4>
<div class="paragraph">
<p>&#x5728;&#x4EE5;&#x592A;&#x574A;&#x4E0A;&#x90E8;&#x7F72;&#x7684;&#x904A;&#x6232;&#xFF0C;&#x5141;&#x8A31;&#x73A9;&#x5BB6;&#x8CFC;&#x8CB7;&#xFF0C;&#x6536;&#x96C6;&#xFF0C;&#x7E41;&#x6B96;&#x548C;&#x92B7;&#x552E;&#x5404;&#x7A2E;&#x985E;&#x578B;&#x7684;&#x865B;&#x64EC;&#x8C93;
&#x5B83;&#x4EE3;&#x8868;&#x4E86;&#x70BA;&#x4F11;&#x9592;&#x548C;&#x60A0;&#x9592;&#x76EE;&#x7684;&#x90E8;&#x7F72;&#x5340;&#x584A;&#x93C8;&#x6280;&#x8853;&#x7684;&#x6700;&#x65E9;&#x5617;&#x8A66;&#x4E4B;&#x4E00;&#x3002;</p>
</div>
<div class="paragraph">
<p>Website&#xFF1A;https://www.cryptokitties.co</p>
</div>
</div>
<div class="sect3">
<h4 id="ethlance_sec">Ethlance</h4>
<div class="paragraph">
<p>Ethlance&#x662F;&#x4E00;&#x500B;&#x9023;&#x63A5;&#x81EA;&#x7531;&#x8077;&#x696D;&#x8005;&#x548C;&#x958B;&#x767C;&#x8005;&#x7684;&#x5E73;&#x81FA;&#xFF0C;&#x7528;ether&#x652F;&#x4ED8;&#x548C;&#x6536;&#x6B3E;&#x3002;</p>
</div>
<div class="paragraph">
<p>Website&#xFF1A;https://ethlance.com/</p>
</div>
</div>
<div class="sect3">
<h4 id="decentraland_sec">Decentraland</h4>
<div class="paragraph">
<p>Decentraland&#x662F;&#x4EE5;&#x592A;&#x574A;&#x5340;&#x584A;&#x93C8;&#x652F;&#x6301;&#x7684;&#x865B;&#x64EC;&#x73FE;&#x5BE6;&#x5E73;&#x81FA;&#x3002;&#x7528;&#x6236;&#x53EF;&#x4EE5;&#x5275;&#x5EFA;&#xFF0C;&#x9AD4;&#x9A57;&#x5167;&#x5BB9;&#x548C;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x4E26;&#x5F9E;&#x4E2D;&#x7372;&#x5229;&#x3002;</p>
</div>
<div class="paragraph">
<p>Website&#xFF1A;https://decentraland.org/</p>
</div>
</div>
</div>
</div>
</div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="10.html" class="navigation navigation-prev " aria-label="Previous page: 第10章 Tokens">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="12.html" class="navigation navigation-next " aria-label="Next page: 第12章 Oracles">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第11章 去中心化應用 (DApps)","level":"1.14","depth":1,"next":{"title":"第12章 Oracles","level":"1.15","depth":1,"path":"12.asciidoc","ref":"12.asciidoc","articles":[]},"previous":{"title":"第10章 Tokens","level":"1.13","depth":1,"path":"10.asciidoc","ref":"10.asciidoc","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["mathjax","livereload"],"pluginsConfig":{"mathjax":{"forceSVG":false,"version":"2.6-latest"},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"11.asciidoc","mtime":"2019-09-08T04:45:08.339Z","type":"asciidoc"},"gitbook":{"version":"3.2.3","time":"2019-09-08T04:45:18.051Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

