
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第15章 共識 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="16.html" />
    
    
    <link rel="prev" href="14.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    精通以太坊
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="前言.html">
            
                <a href="前言.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="術語.html">
            
                <a href="術語.html">
            
                    
                    術語
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="01.html">
            
                <a href="01.html">
            
                    
                    第1章 什麼是以太坊
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="02.html">
            
                <a href="02.html">
            
                    
                    第2章 以太坊基礎
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="03.html">
            
                <a href="03.html">
            
                    
                    第3章 以太坊客戶端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="04.html">
            
                <a href="04.html">
            
                    
                    第4章 以太坊測試網（Testnets）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="05.html">
            
                <a href="05.html">
            
                    
                    第5章 密鑰、地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="06.html">
            
                <a href="06.html">
            
                    
                    第6章 錢包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="07.html">
            
                <a href="07.html">
            
                    
                    第7章 交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="08.html">
            
                <a href="08.html">
            
                    
                    第8章 智能合約
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="09.html">
            
                <a href="09.html">
            
                    
                    第9章 開發工具，框架和庫
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="10.html">
            
                <a href="10.html">
            
                    
                    第10章 Tokens
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="11.html">
            
                <a href="11.html">
            
                    
                    第11章 去中心化應用 (DApps)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="12.html">
            
                <a href="12.html">
            
                    
                    第12章 Oracles
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="13.html">
            
                <a href="13.html">
            
                    
                    第13章 gas（Gas）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="14.html">
            
                <a href="14.html">
            
                    
                    第14章 以太坊虛擬機
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.18" data-path="15.html">
            
                <a href="15.html">
            
                    
                    第15章 共識
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="16.html">
            
                <a href="16.html">
            
                    
                    第16章 Vyper: 面向合約的程式語言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="17.html">
            
                <a href="17.html">
            
                    
                    第17章 節點間的通信 —— 一個簡單的視角
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="18.html">
            
                <a href="18.html">
            
                    
                    第18章 以太坊標準
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="19.html">
            
                <a href="19.html">
            
                    
                    第19章 以太坊分叉歷史
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第15章 共識</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div class="sect1">
<h2 id="__">&#x5171;&#x8B58;</h2>
<div class="sectionbody">
<div class="paragraph">
<p>&#x4EE5;&#x592A;&#x574A;&#x7DB2;&#x8DEF;&#x4E2D;&#x7684;&#x5171;&#x8B58;&#x662F;&#x6307;&#x591A;&#x500B;&#x7BC0;&#x9EDE;&#x6216;&#x4EE3;&#x7406;&#x5728;&#x7D66;&#x5B9A;&#x7684;&#x6642;&#x9593;&#x9EDE;&#x5C31;&#x5340;&#x584A;&#x93C8;&#x72C0;&#x614B;&#x9054;&#x6210;&#x4E00;&#x81F4;&#x7684;&#x80FD;&#x529B;&#x3002;&#x9019;&#x8207;&#x50B3;&#x7D71;&#x7684;&#x5B9A;&#x7FA9;&#x7232;&#x500B;&#x4EBA;&#x6216;&#x7FA3;&#x9AD4;&#x4E4B;&#x9593;&#x7684;&#x4E00;&#x822C;&#x5354;&#x8B70;&#x7684;&#x5171;&#x8B58;&#x5BC6;&#x5207;&#x76F8;&#x95DC;&#x4F46;&#x4E0D;&#x540C;&#x3002;&#x5728;&#x9019;&#x88CF;&#xFF0C;&#x793E;&#x5340;&#x5FC5;&#x9808;&#x89E3;&#x6C7A;&#x5728;&#x6280;&#x8853;&#x4E0A;&#xFF08;&#x5728;&#x7DB2;&#x8DEF;&#x5167;&#xFF09;&#x548C;&#x793E;&#x4EA4;&#x4E0A;&#x9054;&#x6210;&#x5171;&#x8B58;&#x7684;&#x6311;&#x6230;&#xFF08;&#x4EE5;&#x78BA;&#x4FDD;&#x5354;&#x8B70;&#x4E0D;&#x6703;&#x5206;&#x53C9;&#x6216;&#x7834;&#x88C2;&#xFF09;&#x3002;&#x672C;&#x7AE0;&#x5C07;&#x6982;&#x8FF0;&#x5EFA;&#x7ACB;&#x5171;&#x8B58;&#x7684;&#x4E00;&#x4E9B;&#x6280;&#x8853;&#x65B9;&#x6CD5;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x7576;&#x6D89;&#x53CA;&#x5340;&#x584A;&#x93C8;&#x4E0A;&#x5206;&#x6563;&#x8A18;&#x9304;&#x4FDD;&#x5B58;&#x548C;&#x9A57;&#x8B49;&#x7684;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x6642;&#xFF0C;&#x55AE;&#x7368;&#x4F9D;&#x9760;&#x4FE1;&#x4EFB;&#x4F86;&#x78BA;&#x4FDD;&#x6DFB;&#x52A0;&#x5230;&#x5E33;&#x672C;&#x7684;&#x8CC7;&#x8A0A;&#x662F;&#x6B63;&#x78BA;&#x7684;&#x53EF;&#x80FD;&#x6703;&#x6210;&#x7232;&#x554F;&#x984C;&#x3002;&#x9019;&#x7A2E;&#x6311;&#x6230;&#x5728;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7DB2;&#x8DEF;&#x4E2D;&#x66F4;&#x7232;&#x660E;&#x986F;&#xFF0C;&#x56E0;&#x7232;&#x6C92;&#x6709;&#x4E2D;&#x592E;&#x5BE6;&#x9AD4;&#x4F86;&#x6C7A;&#x5B9A;&#x4EC0;&#x9EBC;&#x61C9;&#x8A72;&#x548C;&#x4E0D;&#x61C9;&#x8A72;&#x88AB;&#x8996;&#x7232;&#x662F;&#x771F;&#x5BE6;&#x7684;&#x3002;&#x7F3A;&#x4E4F;&#x4E00;&#x7B87;&#x4E2D;&#x592E;&#x6C7A;&#x7B56;&#x5BE6;&#x9AD4;&#x662F;&#x5340;&#x584A;&#x93C8;&#x53D7;&#x6B61;&#x8FCE;&#x7A0B;&#x5EA6;&#x7684;&#x4E3B;&#x8981;&#x5438;&#x5F15;&#x529B;&#x4E4B;&#x4E00;&#xFF0C;&#x56E0;&#x7232;&#x7CFB;&#x7D71;&#x80FD;&#x5920;&#x62B5;&#x6297;&#x5BE9;&#x67E5;&#x5236;&#x5EA6;&#xFF0C;&#x4E26;&#x4E14;&#x7121;&#x9700;&#x5C0D;&#x8A31;&#x53EF;&#x6216;&#x8CC7;&#x8A0A;&#x7372;&#x53D6;&#x6B0A;&#x9650;&#x7684;&#x4F9D;&#x8CF4;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x9019;&#x4E9B;&#x597D;&#x8655;&#x53EF;&#x80FD;&#x5E36;&#x4F86;&#x6210;&#x672C;&#xFF0C;&#x56E0;&#x7232;&#x5982;&#x679C;&#x6C92;&#x6709;&#x53EF;&#x4FE1;&#x7684;&#x4EF2;&#x88C1;&#x54E1;&#xFF0C;&#x4EFB;&#x4F55;&#x5206;&#x6B67;&#xFF0C;&#x6B3A;&#x9A19;&#x6216;&#x5DEE;&#x7570;&#x90FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6578;&#x5B78;&#xFF0C;&#x7D93;&#x6FDF;&#x6216;&#x793E;&#x6703;&#x6280;&#x8853;&#x9032;&#x884C;&#x5354;&#x8ABF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5206;&#x6563;&#x7684;&#x7CFB;&#x7D71;&#x66F4;&#x6709;&#x62B5;&#x79A6;&#x653B;&#x64CA;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x5728;&#x61C9;&#x5C0D;&#x8B8A;&#x5316;&#x6642;&#x537B;&#x4E0D;&#x90A3;&#x9EBC;&#x679C;&#x65B7;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x7372;&#x5F97;&#x5171;&#x8B58;&#x548C;&#x4FE1;&#x4EFB;&#x8CC7;&#x8A0A;&#x7684;&#x80FD;&#x529B;&#x5C07;&#x5C0D;&#x5340;&#x584A;&#x93C8;&#x6280;&#x8853;&#x4F5C;&#x7232;&#x8CC7;&#x7522;&#x985E;&#x5225;&#x548C;&#x6280;&#x8853;&#x7684;&#x672A;&#x4F86;&#x63A1;&#x7528;&#x548C;&#x5BE6;&#x7528;&#x5177;&#x6709;&#x91CD;&#x8981;&#x610F;&#x7FA9;&#x3002;&#x7232;&#x4E86;&#x61C9;&#x5C0D;&#x9019;&#x4E00;&#x6311;&#x6230;&#x4E26;&#x4FDD;&#x6301;&#x6B0A;&#x529B;&#x4E0B;&#x653E;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x793E;&#x5340;&#x4E0D;&#x65B7;&#x5617;&#x8A66;&#x4E0D;&#x540C;&#x5171;&#x8B58;&#x6A21;&#x5F0F;&#xFF0C;&#x6211;&#x5011;&#x5C07;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x63A2;&#x8A0E;&#x3002;</p>
</div>
<div class="sect2">
<h3 id="___2">&#x5171;&#x8B58;&#x5EA6;&#x91CF;</h3>
<div class="paragraph">
<p>&#x5171;&#x8B58;&#x5EA6;&#x91CF;&#x662F;&#x53EF;&#x6E2C;&#x91CF;&#x7684;&#x6578;&#x64DA;&#xFF0C;&#x5340;&#x584A;&#x93C8;&#x7DB2;&#x8DEF;&#x7684;&#x7BC0;&#x9EDE;&#x5FC5;&#x9808;&#x5728;&#x8A72;&#x6578;&#x64DA;&#x4E0A;&#x9054;&#x6210;&#x4E00;&#x81F4;&#xFF0C;&#x4EE5;&#x4FBF;&#x7232;&#x6BCF;&#x500B;&#x584A;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x6578;&#x64DA;&#x5EFA;&#x7ACB;&#x4E26;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;&#x5728;&#x5340;&#x584A;&#x93C8;&#x6280;&#x8853;&#x4E2D;&#xFF0C;&#x6BCF;&#x6B21;&#x5C07;&#x65B0;&#x584A;&#x6DFB;&#x52A0;&#x5230;&#x93C8;&#x4E2D;&#x6642;&#xFF0C;&#x6BCF;&#x500B;&#x7DB2;&#x8DEF;&#x7BC0;&#x9EDE;&#x90FD;&#x6703;&#x6E2C;&#x91CF;&#x4E26;&#x6279;&#x51C6;&#x4E00;&#x81F4;&#x6027;&#x5EA6;&#x91CF;&#x3002;&#x4F5C;&#x7232;&#x5171;&#x8B58;&#x5EA6;&#x91CF;&#x7684;&#x7D50;&#x679C;&#xFF0C;&#x5340;&#x584A;&#x93C8;&#x5145;&#x7576;&#x4E86;&#x5F9E;&#x4E00;&#x500B;&#x78BA;&#x5B9A;&#x53EF;&#x9A57;&#x8B49;&#x7684;&#x4E8B;&#x5BE6;&#x5EF6;&#x4F38;&#x5230;&#x4E0B;&#x4E00;&#x500B;&#x4E8B;&#x5BE6;&#x7684;&#x771F;&#x7406;&#x93C8;&#x3002;&#x7531;&#x65BC;&#x5171;&#x8B58;&#x5EA6;&#x91CF;&#xFF0C;&#x5340;&#x584A;&#x93C8;&#x5354;&#x8B70;&#x7684;&#x7BC0;&#x9EDE;&#x8B8A;&#x7232; <em>&#x8FF7;&#x4F60;&#x516C;&#x8B49;&#x4EBA;</em> <em>mini-notaries</em>&#xFF0C;&#x80FD;&#x5920;&#x5F9E;&#x771F;&#x5BE6;&#x7684;&#x7BC0;&#x9EDE;&#x4E2D;&#x7ACB;&#x5373;&#x5206;&#x8FA8;&#x51FA;&#x5340;&#x584A;&#x93C8;&#x7684;&#x932F;&#x8AA4;&#x526F;&#x672C;&#xFF0C;&#x4E26;&#x5C07;&#x8A72;&#x4E8B;&#x5BE6;&#x5831;&#x544A;&#x7D66;&#x6574;&#x500B;&#x7DB2;&#x8DEF;&#x3002;&#x9019;&#x4E9B;&#x63AA;&#x65BD;&#x662F;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x4EE5;&#x4FBF;&#x963B;&#x6B62;&#x901A;&#x904E;&#x63D0;&#x4EA4;&#x5305;&#x542B;&#x865B;&#x5047;&#x8CC7;&#x8A0A;&#x7684;&#x5340;&#x584A;&#x4F86;&#x6B3A;&#x9A19;&#x7DB2;&#x8DEF;&#x4E0D;&#x826F;&#x884C;&#x7232;&#x8005;&#x3002;&#x7531;&#x65BC;&#x4E00;&#x81F4;&#x6027;&#x5EA6;&#x91CF;&#xFF0C;&#x5340;&#x584A;&#x93C8;&#x4E0D;&#x50C5;&#x5EFA;&#x7ACB;&#x4E86;&#x7684;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x800C;&#x4E14;&#x9577;&#x671F;&#x4FDD;&#x6301;&#x4E0D;&#x8B8A;&#x3002;&#x5171;&#x8B58;&#x5EA6;&#x91CF;&#x6709;&#x591A;&#x7A2E;&#x5F62;&#x5F0F;&#xFF0C;&#x4F46;&#x5C0D;&#x65BC;&#x6B64;&#x8A0E;&#x8AD6;&#x800C;&#x8A00;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5169;&#x7A2E;&#x662F;&#x57FA;&#x65BC;&#x98A8;&#x96AA;&#x7684;&#x5EA6;&#x91CF;&#x548C;&#x57FA;&#x65BC;&#x5DE5;&#x4F5C;&#x91CF;&#x7684;&#x5EA6;&#x91CF;&#x3002;</p>
</div>
</div>
<div class="sect2">
<h3 id="__hash">&#x57FA;&#x65BC;Hash&#x7684;&#x5EA6;&#x91CF;</h3>
<div class="paragraph">
<p>&#x901A;&#x5E38;&#x7A31;&#x7232;&#x5DE5;&#x4F5C;&#x91CF;&#x8B49;&#x660E;&#xFF08;PoW&#xFF09;&#x5EA6;&#x91CF;&#xFF0C;&#x9019;&#x4E9B;&#x5EA6;&#x91CF;&#x5EFA;&#x7ACB;&#x4E86;&#x5171;&#x8B58;&#xFF0C;&#x56E0;&#x7232;&#x4F7F;&#x7528;&#x5B83;&#x5011;&#x7684;&#x5354;&#x8B70;&#x5C07;&#x8A08;&#x7B97;&#x6A5F;&#x8A2D;&#x7F6E;&#x7232;&#x67E5;&#x627E;&#x96E3;&#x984C;&#x7684;&#x7B54;&#x6848;&#x3002;&#x627E;&#x5230;&#x9069;&#x5408;&#x7DB2;&#x8DEF;&#x53C3;&#x6578;&#x7684;&#x96DC;&#x6E4A;&#x7684;&#x96E3;&#x984C;&#x8981;&#x6C42;&#x7BC0;&#x9EDE;&#x63D0;&#x4EA4;&#x8655;&#x7406;&#x80FD;&#x529B;&#x4E26;&#x4F7F;&#x7528;&#x96FB;&#x529B;&#x8207;&#x5176;&#x4ED6;&#x7BC0;&#x9EDE;&#x7AF6;&#x722D;&#x4EE5;&#x63D0;&#x51FA;&#x6709;&#x6548;&#x7684;&#x96DC;&#x6E4A;&#x3002;&#x7232;&#x4E86;&#x4FBF;&#x65BC;&#x8AAA;&#x660E;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x616E;&#x8D85;&#x7D1A;&#x8A08;&#x7B97;&#x6A5F;&#xFF0C;&#x5B83;&#x7684;&#x552F;&#x4E00;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x5728;&#x6574;&#x6578;&#x7A7A;&#x9593;&#x4E2D;&#x641C;&#x7D22;&#x8CEA;&#x6578;&#x3002;&#x73FE;&#x5728;&#x8003;&#x616E;&#x7531;&#x666E;&#x901A;&#x8A08;&#x7B97;&#x6A5F;&#x7D44;&#x6210;&#x7684;&#x6574;&#x500B;&#x7DB2;&#x8DEF;&#x3002;&#x9019;&#x4E9B;&#x8A08;&#x7B97;&#x6A5F;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x6642;&#xFF0C;&#x53EF;&#x4EE5;&#x8AAA;&#x5177;&#x6709;&#x8D85;&#x7D1A;&#x8A08;&#x7B97;&#x6A5F;&#x7684;&#x7D44;&#x5408;&#x8A08;&#x7B97;&#x80FD;&#x529B;&#x3002;&#x9019;&#x500B;&#x8A08;&#x7B97;&#x6A5F;&#x7DB2;&#x8DEF;&#x7684;&#x552F;&#x4E00;&#x5DE5;&#x4F5C;&#x985E;&#x4F3C;&#x65BC;&#x641C;&#x7D22;&#x53E6;&#x4E00;&#x7A2E;&#x7A31;&#x7232;SHA-256&#x96DC;&#x6E4A;&#x7684;&#x6578;&#x5B57;&#x7684;&#x53EF;&#x80FD;&#x6578;&#x5B57;&#x3002;&#x9019;&#x4E9B;&#x6578;&#x5B57;&#x5177;&#x6709;&#x7368;&#x7279;&#x7684;&#x5C6C;&#x6027;&#xFF0C;&#x5C31;&#x50CF;&#x8CEA;&#x6578;&#x4E00;&#x6A23;&#xFF0C;&#x5118;&#x7BA1;&#x5728;&#x751F;&#x6210;&#x7B26;&#x5408;&#x7DB2;&#x8DEF;&#x8A2D;&#x5B9A;&#x6A19;&#x6E96;&#x7684;&#x96DC;&#x6E4A;&#x65B9;&#x9762;&#x5B58;&#x5728;&#x5F88;&#x5927;&#x56F0;&#x96E3;&#xFF0C;&#x4F46;&#x5728;&#x767C;&#x73FE;&#x6642;&#x53EF;&#x4EE5;&#x8F15;&#x9B06;&#x9A57;&#x8B49;&#x5B83;&#x5011;&#x3002;&#x60F3;&#x8C61;&#x8A08;&#x7B97;&#x96DC;&#x6E4A;&#x548C;&#x9A57;&#x8B49;&#x96DC;&#x6E4A;&#x7684;&#x4E00;&#x7A2E;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x62FC;&#x5716;&#x904A;&#x6232;&#x985E;&#x6BD4;&#x3002;&#x9019;&#x500B;&#x96E3;&#x984C;&#x975E;&#x5E38;&#x56F0;&#x96E3;&#x4E14;&#x8017;&#x6642;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x773C;&#x5C31;&#x80FD;&#x770B;&#x51FA;&#x5B83;&#x662F;&#x5426;&#x5DF2;&#x7D93;&#x5B8C;&#x6210;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x7576;&#x6E96;&#x78BA;&#x8A08;&#x7B97;SHA-256&#x96DC;&#x6E4A;&#x503C;&#x6642;&#xFF0C;&#x5B83;&#x5011;&#x53EF;&#x7528;&#x4F5C;&#x8B49;&#x660E;&#x5DF2;&#x4F7F;&#x7528;&#x4E00;&#x5B9A;&#x91CF;&#x7684;&#x8A08;&#x7B97;&#x80FD;&#x529B;&#x4F86;&#x67E5;&#x627E;&#x6578;&#x5B57;&#x7684;&#x8B49;&#x660E;&#x3002;&#x6700;&#x65B0;&#x7684;&#x8CEA;&#x6578;&#x662F;asciimath&#xFF1A;[2^(77,232,917&#xFF09;- 1]&#x3002;&#x5B83;&#x662F;&#x7531;&#x8A08;&#x7B97;&#x6A5F;&#x767C;&#x73FE;&#x7684;&#xFF0C;&#x5C31;&#x50CF;&#x8A08;&#x7B97;&#x6A5F;&#x767C;&#x73FE;&#x7684;SHA-256&#x96DC;&#x6E4A;&#x4E00;&#x6A23;&#x3002;SHA-256&#x96DC;&#x6E4A;&#x6BD4;&#x65B0;&#x8CEA;&#x6578;&#x66F4;&#x5BB9;&#x6613;&#x627E;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x627E;&#x5230;&#x96DC;&#x6E4A;&#x7684;&#x56FA;&#x6709;&#x96E3;&#x9EDE;&#x5728;&#x65BC;&#x57FA;&#x65BC;&#x96DC;&#x6E4A;&#x7684;&#x5EA6;&#x91CF;&#x5F97;&#x51FA;&#x5B83;&#x5011;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x6BCF;&#x500B;SHA-256&#x96DC;&#x6E4A;&#x90FD;&#x6709;64&#x500B;&#x5341;&#x516D;&#x9032;&#x5236;&#x5B57;&#x7B26;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x9019;&#x88CF;&#x662F;&#x55AE;&#x8A5E;&#x201C;yank&#x201D;&#x7684;SHA-256&#x96DC;&#x6E4A;&#x3002;
<code>&#x201C;yank&#x201D;&#xFF08;SHA-256&#xFF09;= 45F1B9FC8FD5F760A2134289579DF920AA55830F2A23DCF50D34E16C1292D7E0</code></p>
</div>
<div class="paragraph">
<p>&#x5C07;&#x5176;&#x8207;&#x4E09;&#x500B;&#x5B57;&#x6BCD;&#x201C;yan&#x201D;&#x7684;SHA-256&#x96DC;&#x6E4A;&#xFF1A;</p>
</div>
<div class="paragraph">
<p><code>&#x201C;yan&#x201D;&#xFF08;SHA-256&#xFF09;= 281ACA1A80B52620BD717E8B14A0386B8ADA92AE859AC2C8A2AC222EFA0&#x200B;&#x200B;2EDBB</code></p>
</div>
<div class="paragraph">
<p>&#x5169;&#x500B;&#x5B57;&#x6BCD;&#x201C;ya&#x201D;&#x7684;SHA-256&#x96DC;&#x6E4A;&#xFF1A;</p>
</div>
<div class="paragraph">
<p><code>&#x201C;ya&#x201D;&#xFF08;SHA-256&#xFF09;= 6663103A3E47EFC879EA31FA38458BE23BE0CE0895F3D8B27B7EA19A1120B3D4</code></p>
</div>
<div class="paragraph">
<p>&#x55AE;&#x500B;&#x5B57;&#x6BCD;&#x201C;y&#x201D;&#x7684;SHA-256&#x96DC;&#x6E4A;&#xFF1A;</p>
</div>
<div class="paragraph">
<p><code>&#x201C;y&#x201D;&#xFF08;SHA-256&#xFF09;= A1FCE4363854FF888CFF4B8E7875D600C2682390412A8CF79B37D0B11148B0FA</code></p>
</div>
</div>
<div class="sect2">
<h3 id="___3">&#x57FA;&#x65BC;&#x96DC;&#x6E4A;&#x7684;&#x5EA6;&#x91CF;&#x9A57;&#x8B49;</h3>
<div class="paragraph">
<p>&#x5982;&#x679C;&#x4F60;&#x5C0D;&#x8DB3;&#x5920;&#x591A;&#x7684;&#x96A8;&#x6A5F;&#x77ED;&#x8A9E;&#x9032;&#x884C;&#x4E86;&#x96DC;&#x6E4A;&#xFF0C;&#x6709;&#x9EDE;&#x50CF;&#x6253;&#x5B57;&#x6A5F;&#x4E0A;&#x7684;&#x7334;&#x5B50;&#xFF0C;&#x6700;&#x7D42;&#x4F60;&#x6703;&#x767C;&#x73FE;&#x4E00;&#x500B;&#x5339;&#x914D;&#x7279;&#x5B9A;&#x6A21;&#x5F0F;&#x7684;&#x96DC;&#x6E4A;&#x3002;&#x5728;&#x96DC;&#x6E4A;&#x7232;&#x201C;ya&#x201D;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;&#x8ACB;&#x6CE8;&#x610F;&#x5B83;&#x4EE5;&#x6A21;&#x5F0F;&#x201C;666&#x201D;&#x958B;&#x982D;&#x3002;&#x9019;&#x985E;&#x4F3C;&#x65BC;&#x6BD4;&#x7279;&#x5E63;&#xFF0C;&#x4F46;&#x6BD4;&#x7279;&#x5E63;&#x8981;&#x6C42;&#x627E;&#x5230;&#x8207;&#x4EE5;&#x201C;000&#x201D;&#x958B;&#x982D;&#x7684;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x7684;&#x96DC;&#x6E4A;&#x503C;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x904E;&#x5C07;&#x524D;&#x4E00;&#x500B;&#x5340;&#x584A;&#x4E2D;&#x7684;&#x8CC7;&#x8A0A;&#x63D2;&#x5165;&#x5230;SHA-256&#x96DC;&#x6E4A;&#x6F14;&#x7B97;&#x6CD5;&#x4E2D;&#x4F86;&#x5275;&#x5EFA;&#x7684;&#x4EFB;&#x4F55;&#x96DC;&#x6E4A;&#xFF0C;&#x4E26;&#x7528;&#x65BC;&#x5275;&#x5EFA;&#x4E0B;&#x4E00;&#x500B;&#x584A;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x5728;&#x6578;&#x5B57;&#x4E2D;&#x5177;&#x6709;&#x6B63;&#x78BA;&#x6578;&#x91CF;&#x7684;&#x524D;&#x5C0E;&#x96F6;&#xFF0C;&#x7DB2;&#x8DEF;&#x5C31;&#x6703;&#x8A8D;&#x53EF;&#xFF0C;&#x4E26;&#x4E14;&#x5340;&#x584A;&#x734E;&#x52F5;&#x5C07;&#x662F;&#x4F60;&#x7684;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x7531;&#x65BC;&#x60F3;&#x8981;&#x6316;&#x6398;&#x6BD4;&#x7279;&#x5E63;&#x7684;&#x4EBA;&#x6578;&#x4E0D;&#x65B7;&#x589E;&#x52A0;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x79D2;&#x5C0B;&#x627E;SHA-256&#x96DC;&#x6E4A;&#x503C;&#x7684;&#x7B97;&#x529B;&#x7E3D;&#x662F;&#x8D8A;&#x4F86;&#x8D8A;&#x591A;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x8EDF;&#x9AD4;&#x901A;&#x904E;&#x81EA;&#x52D5;&#x8ABF;&#x6574;&#x5171;&#x8B58;&#x5EA6;&#x91CF;&#x7684;&#x96E3;&#x5EA6;&#x4F86;&#x8655;&#x7406;&#x9019;&#x7A2E;&#x610F;&#x5916;&#x4E8B;&#x4EF6;&#xFF0C;&#x589E;&#x52A0;&#x524D;&#x5C0E;&#x96F6;&#x7684;&#x6578;&#x91CF;&#x4EE5;&#x5F62;&#x6210;&#x5171;&#x8B58;&#x3002;&#x9019;&#x53EF;&#x4EE5;&#x4FDD;&#x8B49;&#x65B0;&#x584A;&#x7684;&#x5275;&#x5EFA;&#x6642;&#x9593;&#x8207;&#x524D;&#x9762;&#x7684;&#x584A;&#x5927;&#x81F4;&#x76F8;&#x540C;&#x3002;&#x5C0D;&#x65BC;&#x6BD4;&#x7279;&#x5E63;&#x7DB2;&#x8DEF;&#xFF0C;&#x7232;&#x5341;&#x5206;&#x9418;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x8F15;&#x9B06;&#x66F4;&#x6539;&#x3002;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x4E2D;&#xFF0C;&#x5E73;&#x5747;&#x5340;&#x584A;&#x751F;&#x6210;&#x6642;&#x9593;&#x7D04;&#x7232;10&#x79D2;&#x3002;</p>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="___4">&#x57FA;&#x65BC;&#x98A8;&#x96AA;&#x7684;&#x5EA6;&#x91CF;</h2>
<div class="sectionbody">
<div class="paragraph">
<p>&#x901A;&#x5E38;&#x7A31;&#x7232;Proof-of-Stake&#xFF08;PoS&#xFF09;&#x5EA6;&#x91CF;&#xFF0C;&#x9019;&#x4E9B;&#x5EA6;&#x91CF;&#x57FA;&#x65BC;&#x4EE5;&#x4E0B;&#x4E8B;&#x5BE6;&#x5EFA;&#x7ACB;&#x5171;&#x8B58;&#xFF1A;&#x9078;&#x64C7;&#x5275;&#x5EFA;&#x7121;&#x6548;&#x5340;&#x584A;&#x7684;&#x6BCF;&#x500B;&#x4EBA;&#x90FD;&#x6703;&#x5931;&#x53BB;&#x6BD4;&#x901A;&#x904E;&#x5275;&#x5EFA;&#x6709;&#x6548;&#x5340;&#x584A;&#x7372;&#x5F97;&#x7684;&#x66F4;&#x591A;&#x7684;&#x6771;&#x897F;&#x3002;&#x8A72;&#x5EA6;&#x91CF;&#x662F;&#x901A;&#x904E;&#x95DC;&#x65BC;&#x93C8;&#x5167;&#x6578;&#x64DA;&#x7684;&#x5171;&#x8B58;&#x5275;&#x9020;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x95DC;&#x65BC;&#x93C8;&#x5916;&#x6578;&#x64DA;&#x7684;&#x5171;&#x8B58;&#x3002;&#x57FA;&#x65BC;&#x96DC;&#x6E4A;&#x7684;&#x5171;&#x8B58;&#x5EA6;&#x91CF;&#x4E3B;&#x8981;&#x95DC;&#x6CE8;SHA-256&#x96DC;&#x6E4A;&#x7684;&#x8CEA;&#x91CF;&#x548C;&#x7CBE;&#x78BA;&#x6027;&#x3002;&#x57FA;&#x65BC;&#x98A8;&#x96AA;&#x7684;&#x5EA6;&#x91CF;&#x4E3B;&#x8981;&#x95DC;&#x6CE8;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x7BC0;&#x9EDE;&#x5728;&#x6DFB;&#x52A0;&#x65B0;&#x584A;&#x6642;&#x6240;&#x627F;&#x64D4;&#x7684;&#x98A8;&#x96AA;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x6240;&#x6709;&#x7BC0;&#x9EDE;&#x5728;&#x9019;&#x88CF;&#x9054;&#x6210;&#x4E00;&#x81F4;&#x7684;&#x5EA6;&#x91CF;&#x662F;&#x54EA;&#x4E9B;&#x7BC0;&#x9EDE;&#x5275;&#x5EFA;&#x4E86;&#x6B63;&#x78BA;&#x7684;&#x584A;&#xFF0C;&#x54EA;&#x4E9B;&#x7BC0;&#x9EDE;&#x6C92;&#x6709;&#x3002;&#x5728;&#x67D0;&#x7A2E;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x9019;&#x5DF2;&#x7D93;&#x5167;&#x5EFA;&#x5728;&#x6BD4;&#x7279;&#x5E63;&#x5354;&#x8B70;&#x4E2D;&#x3002;&#x6BD4;&#x7279;&#x5E63;&#x5354;&#x8B70;&#x5047;&#x5B9A;&#x6B63;&#x78BA;&#x7684;&#x584A;&#x662F;&#x5927;&#x591A;&#x6578;&#x7BC0;&#x9EDE;&#x6B63;&#x5728;&#x6316;&#x6398;&#x7684;&#x584A;&#x3002;&#x5B83;&#x5047;&#x8A2D;&#x7926;&#x5DE5;&#x4E0D;&#x6703;&#x9078;&#x64C7;&#x4E0D;&#x6B63;&#x78BA;&#x7684;&#x5340;&#x584A;&#xFF0C;&#x56E0;&#x7232;&#x9019;&#x4E0D;&#x5229;&#x65BC;&#x6316;&#x6398;&#x58DE;&#x5340;&#x584A;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x57FA;&#x65BC;&#x98A8;&#x96AA;&#x7684;&#x93C8;&#x4F9D;&#x8CF4;&#x65BC;&#x5C0D;&#x672A;&#x80FD;&#x5275;&#x5EFA;&#x7DB2;&#x8DEF;&#x4E2D;&#x5176;&#x4ED6;&#x7BC0;&#x9EDE;&#x8A8D;&#x53EF;&#x7684;&#x584A;&#x7684;&#x5275;&#x5EFA;&#x8005;&#x7684;&#x5FEB;&#x901F;&#xFF0C;&#x5373;&#x6642;&#x548C;&#x4E0D;&#x53EF;&#x9006;&#x8F49;&#x7684;&#x5F71;&#x97FF;&#x3002;&#x901A;&#x904E;&#x5F37;&#x5236;&#x57F7;&#x884C;&#x8CC7;&#x6E90;&#x4E1F;&#x5931;&#x7684;&#x98A8;&#x96AA;&#xFF0C;&#x57FA;&#x65BC;&#x96DC;&#x6E4A;&#x7684;&#x5EA6;&#x91CF;&#xFF08;&#x4E5F;&#x4F9D;&#x8CF4;&#x65BC;&#x4E0D;&#x60F3;&#x6D6A;&#x8CBB;&#x8CC7;&#x6E90;&#x7684;&#x4EBA;&#x54E1;&#xFF09;&#x904E;&#x7A0B;&#x53EF;&#x4EE5;&#x4EE5;&#x66F4;&#x7C21;&#x55AE;&#x7684;&#x65B9;&#x5F0F;&#x9032;&#x884C;&#x7E2E;&#x77ED;&#x548C;&#x5BE6;&#x65BD;&#x3002;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x7814;&#x7A76;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x4E2D;&#x5BE6;&#x73FE;&#x9019;&#x7A2E;&#x5171;&#x8B58;&#x5EA6;&#x91CF;&#x6A21;&#x578B;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5DE5;&#x4F5C;&#x91CF;&#x8B49;&#x660E;&#x662F;&#x4E00;&#x7A2E;&#x5171;&#x8B58;&#x5354;&#x8B70;&#xFF0C;&#x5B83;&#x5C07;&#x7DB2;&#x8DEF;&#x4E2D;&#x7684;&#x6709;&#x6548;&#x5340;&#x584A;&#x93C8;&#x8996;&#x7232;&#x5275;&#x5EFA;&#x8A08;&#x7B97;&#x6210;&#x672C;&#x6700;&#x9AD8;&#x7684;&#x93C8;&#x3002;&#x9019;&#x88CF;&#x63D0;&#x5230;&#x7684;&#x8A08;&#x7B97;&#x5DE5;&#x4F5C;&#x662F;&#x5C07;&#x6240;&#x6709;&#x584A;&#x6DFB;&#x52A0;&#x5230;&#x7576;&#x524D;&#x5340;&#x584A;&#x93C8;&#x6240;&#x5FC5;&#x9808;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x9019;&#x9805;&#x5DE5;&#x4F5C;&#x7531;&#x7DB2;&#x8DEF;&#x7BC0;&#x9EDE;&#x5B8C;&#x6210;&#xFF0C;&#x4E26;&#x4E14;&#x5FC5;&#x9808;&#x5728;&#x8A08;&#x7B97;&#x4E0A;&#x5F88;&#x56F0;&#x96E3;&#xFF0C;&#x4EE5;&#x4FBF;&#x4F7F;&#x5DE5;&#x4F5C;&#x8B8A;&#x5F97;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x4E5F;&#x5FC5;&#x9808;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x7D93;&#x904E;&#x5408;&#x7406;&#x7684;&#x52AA;&#x529B;&#x4E4B;&#x5F8C;&#x53EF;&#x4EE5;&#x5BE6;&#x73FE;&#x3002;&#x6700;&#x7D42;&#xFF0C;&#x7DB2;&#x8DEF;&#x5C07;&#x4F9D;&#x8CF4;&#x65BC;&#x63D0;&#x4F9B;&#x6B64;PoW&#x7684;&#x7BC0;&#x9EDE;&#x4EE5;&#x7DAD;&#x6301;&#x5340;&#x584A;&#x93C8;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x7DB2;&#x8DEF;&#x7684;&#x6700;&#x4F73;&#x5229;&#x76CA;&#x662F;&#x9700;&#x8981;&#x5408;&#x7406;&#x7684;PoW&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5728;&#x4EE5;&#x592A;&#x574A;&#x7DB2;&#x8DEF;&#x4EE5;&#x53CA;&#x8A31;&#x591A;&#x5176;&#x4ED6;&#x5340;&#x584A;&#x93C8;&#x7DB2;&#x8DEF;&#x4E2D;&#xFF0C;&#x7372;&#x53D6;PoW&#x9700;&#x8981;&#x627E;&#x5230;&#x8981;&#x6DFB;&#x52A0;&#x5230;&#x5340;&#x584A;&#x93C8;&#x7684;&#x584A;&#x7684;&#x96DC;&#x6E4A;&#x3002;&#x9019;&#x500B;&#x96DC;&#x6E4A;&#x662F;&#x901A;&#x904E;&#x96DC;&#x6E4A;&#x7531;&#x584A;&#x7684;&#x6578;&#x64DA;&#x548C;&#x96A8;&#x6A5F;&#x6578;&#x7D44;&#x6210;&#x7684;&#x5B57;&#x4E32;&#x7372;&#x5F97;&#x7684;&#xFF08;&#x5275;&#x5EFA;&#x6B64;&#x5B57;&#x4E32;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x6703;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x6574;&#x500B;&#x904E;&#x7A0B;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF09;&#x3002;&#x8A72;&#x96DC;&#x6E4A;&#x5FC5;&#x9808;&#x5C0F;&#x65BC;&#x67D0;&#x500B;&#x95BE;&#x503C;&#xFF08;&#x7531;&#x7DB2;&#x8DEF;&#x7684;&#x96E3;&#x5EA6;&#x78BA;&#x5B9A;&#xFF09;&#xFF0C;&#x4E26;&#x4E14;&#x4E00;&#x65E6;&#x7BC0;&#x9EDE;&#x767C;&#x73FE;&#x7522;&#x751F;&#x8A72;&#x96DC;&#x6E4A;&#x7684;&#x96A8;&#x6A5F;&#x6578;&#xFF0C;&#x5247;&#x63A5;&#x53D7;&#x76F8;&#x61C9;&#x7684;&#x584A;&#x4E26;&#x5C07;&#x5176;&#x6DFB;&#x52A0;&#x5230;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x627E;&#x5230;&#x9019;&#x500B;&#x6709;&#x6548;&#x96DC;&#x6E4A;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4FEE;&#x6539;nonce&#xFF0C;&#x901A;&#x5E38;&#x5C07;&#x5176;&#x521D;&#x59CB;&#x5316;&#x7232;&#x96F6;&#x4E26;&#x5728;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x6642;&#x905E;&#x589E;&#xFF0C;&#x76F4;&#x5230;&#x7522;&#x751F;&#x4F4E;&#x65BC;&#x7DB2;&#x8DEF;&#x95BE;&#x503C;&#x7684;&#x96DC;&#x6E4A;&#x3002;&#x6B64;&#x904E;&#x7A0B;&#x7A31;&#x7232;&#x6316;&#x6398;&#x3002;&#x7531;&#x65BC;&#x6316;&#x6398;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x96DC;&#x6E4A;&#x51FD;&#x6578;&#x7684;&#x6027;&#x8CEA;&#xFF0C;&#x627E;&#x5230;&#x6709;&#x6548;&#x96A8;&#x6A5F;&#x6578;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x904E;&#x66B4;&#x529B;&#x641C;&#x7D22;&#xFF0C;&#x5373;&#x6AA2;&#x67E5;&#x96A8;&#x6A5F;&#x6578;&#x7684;&#x6BCF;&#x500B;&#x53EF;&#x80FD;&#x503C;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x6EFF;&#x8DB3;&#x7DB2;&#x8DEF;&#x8981;&#x6C42;&#x7684;&#x96DC;&#x6E4A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x63D0;&#x4F9B;&#x6709;&#x6548;&#x7684;&#x96A8;&#x6A5F;&#x6578;&#x88AB;&#x8A8D;&#x7232;&#x662F;PoW&#x3002;</p>
</div>
<div class="sect2">
<h3 id="_pos">PoS</h3>
<div class="paragraph">
<p>&#x6B0A;&#x76CA;&#x8B49;&#x660E;&#xFF08;PoS&#xFF0C;Proof-of-Stake&#xFF09;&#x662F;&#x516C;&#x5171;&#x5340;&#x584A;&#x93C8;&#x7684;&#x4E00;&#x985E;&#x5171;&#x8B58;&#x6F14;&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x4F9D;&#x8CF4;&#x65BC;&#x9A57;&#x8B49;&#x8005;&#x5728;&#x7DB2;&#x8DEF;&#x4E2D;&#x7684;&#x7D93;&#x6FDF;&#x5229;&#x76CA;&#x3002;&#x5728;&#x57FA;&#x65BC;&#x5DE5;&#x4F5C;&#x91CF;&#x8B49;&#x660E;&#xFF08;PoW&#xFF09;&#x7684;&#x516C;&#x5171;&#x5340;&#x584A;&#x93C8;&#xFF08;&#x4F8B;&#x5982;&#x6BD4;&#x7279;&#x5E63;&#x548C;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x7576;&#x524D;&#x5BE6;&#x73FE;&#xFF09;&#x4E2D;&#xFF0C;&#x8A72;&#x6F14;&#x7B97;&#x6CD5;&#x734E;&#x52F5;&#x89E3;&#x5BC6;&#x52A0;&#x5BC6;&#x8B0E;&#x984C;&#x7684;&#x53C3;&#x8207;&#x8005;&#xFF0C;&#x4EE5;&#x4FBF;&#x9A57;&#x8B49;&#x4EA4;&#x6613;&#x4E26;&#x5275;&#x5EFA;&#x65B0;&#x7684;&#x584A;&#xFF08;&#x5373;&#x6316;&#x6398;&#xFF09;&#x3002;&#x5728;&#x57FA;&#x65BC;PoS&#x7684;&#x516C;&#x5171;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#xFF08;&#x4F8B;&#x5982;&#x4EE5;&#x592A;&#x574A;&#x5373;&#x5C07;&#x767C;&#x4F48;&#x7684;Casper&#x5BE6;&#x73FE;&#xFF09;&#xFF0C;&#x4E00;&#x7D44;&#x9A57;&#x8B49;&#x8005;&#x8F2A;&#x6D41;&#x5C0D;&#x4E0B;&#x4E00;&#x500B;&#x584A;&#x9032;&#x884C;&#x5EFA;&#x8B70;&#x548C;&#x6295;&#x7968;&#xFF0C;&#x6BCF;&#x500B;&#x9A57;&#x8B49;&#x8005;&#x7684;&#x6295;&#x7968;&#x6B0A;&#x91CD;&#x53D6;&#x6C7A;&#x65BC;&#x5176;&#x5B58;&#x6B3E;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x5373;&#x8CED;&#x6CE8;&#xFF09;&#x3002;PoS&#x7684;&#x986F;&#x7740;&#x512A;&#x52E2;&#x5305;&#x62EC;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x964D;&#x4F4E;&#x96C6;&#x4E2D;&#x98A8;&#x96AA;&#x548C;&#x80FD;&#x6E90;&#x6548;&#x7387;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x901A;&#x5E38;&#xFF0C;&#x6B0A;&#x76CA;&#x8B49;&#x660E;&#x6F14;&#x7B97;&#x6CD5;&#x5982;&#x4E0B;&#x3002;&#x5340;&#x584A;&#x93C8;&#x8DDF;&#x8E64;&#x4E00;&#x7D44;&#x9A57;&#x8B49;&#x8005;&#xFF0C;&#x4EFB;&#x4F55;&#x6301;&#x6709;&#x5340;&#x584A;&#x93C8;&#x57FA;&#x672C;&#x5BC6;&#x78BC;&#x8CA8;&#x5E63;&#x7684;&#x4EBA;&#xFF08;&#x5728;&#x4EE5;&#x592A;&#x574A;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#x662F;ether&#xFF09;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x904E;&#x767C;&#x9001;&#x4E00;&#x7A2E;&#x7279;&#x6B8A;&#x985E;&#x578B;&#x7684;&#x4EA4;&#x6613;&#x4F86;&#x5C07;&#x5176;&#x4EE5;&#x592A;&#x5E63;&#x9396;&#x5B9A;&#x5230;&#x5B58;&#x6B3E;&#x4E2D;&#xFF0C;&#x5F9E;&#x800C;&#x6210;&#x7232;&#x9A57;&#x8B49;&#x8005;&#x3002;&#x7136;&#x5F8C;&#xFF0C;&#x901A;&#x904E;&#x6240;&#x6709;&#x7576;&#x524D;&#x9A57;&#x8B49;&#x8005;&#x90FD;&#x53EF;&#x4EE5;&#x53C3;&#x8207;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x6F14;&#x7B97;&#x6CD5;&#x4F86;&#x5B8C;&#x6210;&#x5275;&#x5EFA;&#x548C;&#x540C;&#x610F;&#x65B0;&#x584A;&#x7684;&#x904E;&#x7A0B;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x6709;&#x8A31;&#x591A;&#x7A2E;&#x5171;&#x8B58;&#x6F14;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x8A31;&#x591A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x7232;&#x53C3;&#x8207;&#x5171;&#x8B58;&#x6F14;&#x7B97;&#x6CD5;&#x7684;&#x9A57;&#x8B49;&#x4EBA;&#x5206;&#x914D;&#x734E;&#x52F5;&#xFF0C;&#x56E0;&#x6B64;&#x6709;&#x8A31;&#x591A;&#x201C;&#x53E3;&#x5473;&#x201D;&#x7684;&#x6B0A;&#x76CA;&#x8B49;&#x660E;&#x3002;&#x5F9E;&#x6F14;&#x7B97;&#x6CD5;&#x7684;&#x89D2;&#x5EA6;&#x4F86;&#x770B;&#xFF0C;&#x6709;&#x5169;&#x7A2E;&#x4E3B;&#x8981;&#x985E;&#x578B;&#xFF1A;&#x57FA;&#x65BC;&#x93C8;&#x7684;&#x6B0A;&#x76CA;&#x8B49;&#x660E;&#x548C;BFT&#x98A8;&#x683C;&#x7684;&#x6B0A;&#x76CA;&#x8B49;&#x660E;&#x3002;</p>
</div>
<div class="ulist">
<ul>
<li>
<p>&#x5728;&#x57FA;&#x65BC;&#x93C8;&#x7684;&#x8B49;&#x660E;&#x4E2D;&#xFF0C;&#x6F14;&#x7B97;&#x6CD5;&#x5728;&#x6BCF;&#x500B;&#x6642;&#x9699;&#x4E2D;&#x50DE;&#x96A8;&#x6A5F;&#x5730;&#x9078;&#x64C7;&#x4E00;&#x500B;&#x9A57;&#x8B49;&#x8005;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6BCF;&#x500B;10&#x79D2;&#x7684;&#x9031;&#x671F;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x500B;&#x6642;&#x9699;&#xFF09;&#xFF0C;&#x4F75;&#x7232;&#x8A72;&#x9A57;&#x8B49;&#x8005;&#x5206;&#x914D;&#x5275;&#x5EFA;&#x55AE;&#x500B;&#x584A;&#x7684;&#x6B0A;&#x9650;&#xFF0C;&#x9019;&#x500B;&#x584A;&#x5FC5;&#x9808;&#x6307;&#x5411;&#x4E00;&#x4E9B;&#x524D;&#x4E00;&#x500B;&#x584A;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x524D;&#x4E00;&#x500B;&#x6700;&#x9577;&#x93C8;&#x672B;&#x7AEF;&#x7684;&#x584A;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x96A8;&#x7740;&#x6642;&#x9593;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x5927;&#x591A;&#x6578;&#x584A;&#x6703;&#x805A;&#x6210;&#x4E00;&#x500B;&#x4E0D;&#x65B7;&#x589E;&#x9577;&#x7684;&#x93C8;&#x3002;</p>
</li>
<li>
<p>&#x5728;BFT&#x98A8;&#x683C;&#x7684;&#x80A1;&#x6B0A;&#x8B49;&#x660E;&#x4E2D;&#xFF0C;&#x9A57;&#x8B49;&#x8005;&#x88AB;&#x96A8;&#x6A5F;&#x5206;&#x914D;&#x63D0;&#x51FA;&#x5340;&#x584A;&#x7684;&#x6B0A;&#x5229;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x904E;&#x591A;&#x8F2A;&#x904E;&#x7A0B;&#x4F86;&#x78BA;&#x5B9A;&#x54EA;&#x500B;&#x5340;&#x584A;&#x662F;&#x898F;&#x7BC4;&#x7684;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x500B;&#x9A57;&#x8B49;&#x8005;&#x5728;&#x6BCF;&#x8F2A;&#x4E2D;&#x767C;&#x9001;&#x5C0D;&#x67D0;&#x500B;&#x7279;&#x5B9A;&#x5340;&#x584A;&#x7684;&#x201C;&#x6295;&#x7968;&#x201D;&#xFF0C;&#x5728;&#x6D41;&#x7A0B;&#x7D50;&#x675F;&#x6642;&#xFF0C;&#x6240;&#x6709;&#xFF08;&#x8AA0;&#x5BE6;&#x548C;&#x5728;&#x7DDA;&#xFF09;&#x9A57;&#x8B49;&#x8005;&#x6C38;&#x4E45;&#x540C;&#x610F;&#x4EFB;&#x4F55;&#x7D66;&#x5B9A;&#x7684;&#x584A;&#x662F;&#x5426;&#x5C6C;&#x65BC;&#x93C8;&#x689D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x8ACB;&#x6CE8;&#x610F;&#xFF0C;&#x584A;&#x53EF;&#x80FD;&#x4ECD;&#x7136;&#x93C8;&#x63A5;&#x5728;&#x4E00;&#x8D77;; &#x95DC;&#x9375;&#x7684;&#x5340;&#x5225;&#x5728;&#x65BC;&#x584A;&#x4E0A;&#x7684;&#x5171;&#x8B58;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x500B;&#x584A;&#x5167;&#xFF0C;&#x4E26;&#x4E14;&#x4E0D;&#x4F9D;&#x8CF4;&#x65BC;&#x5B83;&#x4E4B;&#x5F8C;&#x7684;&#x93C8;&#x7684;&#x9577;&#x5EA6;&#x6216;&#x5927;&#x5C0F;&#x3002;</p>
</li>
</ul>
</div>
<div class="sect3">
<h4 id="_poa">PoA</h4>
<div class="paragraph">
<p>&#x6388;&#x6B0A;&#x8B49;&#x660E;&#xFF08;PoA&#xFF09;&#x662F;PoS&#x4E00;&#x81F4;&#x6027;&#x6F14;&#x7B97;&#x6CD5;&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x4E3B;&#x8981;&#x7531;&#x6E2C;&#x8A66;&#x7DB2;&#x548C;&#x79C1;&#x6709;&#x6216;&#x806F;&#x76DF;&#x7DB2;&#x8DEF;&#x4F7F;&#x7528;&#x3002;&#x5728;&#x57FA;&#x65BC;PoA&#x7684;&#x5340;&#x584A;&#x93C8;&#x4E2D;&#xFF0C;&#x4EA4;&#x6613;&#x6709;&#x6548;&#x6027;&#x6700;&#x7D42;&#x7531;&#x4E00;&#x7D44;&#x7D93;&#x6279;&#x51C6;&#x7684;&#x93C8;&#x4E0A;&#x5E33;&#x6236;&#x78BA;&#x5B9A;&#xFF0C;&#x7A31;&#x7232;&#x201C;&#x6388;&#x6B0A;&#x7BC0;&#x9EDE;&#x201D;&#x3002;&#x78BA;&#x5B9A;&#x6388;&#x6B0A;&#x7BC0;&#x9EDE;&#x7684;&#x6A19;&#x6E96;&#x662F;&#x901A;&#x904E;&#x7DB2;&#x8DEF;&#x6CBB;&#x7406;&#x7D50;&#x69CB;&#x4E2D;&#x7DE8;&#x5BEB;&#x7684;&#x65B9;&#x6CD5;&#x78BA;&#x5B9A;&#x6027;&#x5730;&#x6C7A;&#x5B9A;&#x7684;&#x3002;</p>
</div>
<div class="paragraph">
<p>PoA&#x88AB;&#x5EE3;&#x6CDB;&#x8A8D;&#x7232;&#x662F;&#x9054;&#x6210;&#x5171;&#x8B58;&#x7684;&#x6700;&#x5FEB;&#x9014;&#x5F91;&#xFF0C;&#x4F46;&#x4F9D;&#x8CF4;&#x65BC;&#x9A57;&#x8B49;&#x7BC0;&#x9EDE;&#x5C1A;&#x672A;&#x53D7;&#x5230;&#x640D;&#x5BB3;&#x7684;&#x5047;&#x8A2D;&#x3002;&#x975E;&#x9A57;&#x8B49;&#x53C3;&#x8207;&#x8005;&#x53EF;&#x4EE5;&#x50CF;&#x516C;&#x5171;&#x4EE5;&#x592A;&#x7DB2;&#x90A3;&#x6A23;&#x8A2A;&#x554F;&#x548C;&#x4F7F;&#x7528;&#x7DB2;&#x8DEF;&#xFF08;&#x901A;&#x904E;&#x5229;&#x7528;p2p&#x4EA4;&#x6613;&#xFF0C;&#x5408;&#x7D04;&#xFF0C;&#x5E33;&#x6236;&#x7B49;&#xFF09;</p>
</div>
<div class="paragraph">
<p>PoA&#x5171;&#x8B58;&#x4F9D;&#x8CF4;&#x65BC;&#x9A57;&#x8B49;&#x8005;&#x7684;&#x8072;&#x8B7D;&#x548C;&#x904E;&#x53BB;&#x7684;&#x8868;&#x73FE;&#x3002;&#x9019;&#x500B;&#x60F3;&#x6CD5;&#x662F;&#x9A57;&#x8B49;&#x8005;&#x7BC0;&#x9EDE;&#x5C07;&#x5176;&#x8EAB;&#x4EFD;/&#x8072;&#x8B7D;&#x653E;&#x5230;&#x6211;&#x7684;&#x8EAB;&#x4E0A;&#x3002;&#x79C1;&#x4EBA;&#x806F;&#x76DF;&#x7DB2;&#x8DEF;&#x7684;&#x4E00;&#x500B;&#x91CD;&#x8981;&#x65B9;&#x9762;&#x662F;&#x93C8;&#x4E0A;&#x5730;&#x5740;&#x8207;&#x5DF2;&#x77E5;&#x7684;&#x73FE;&#x5BE6;&#x4E16;&#x754C;&#x8EAB;&#x4EFD;&#x4E4B;&#x9593;&#x7684;&#x806F;&#x7E6B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x8AAA;&#x9A57;&#x8B49;&#x7BC0;&#x9EDE;&#x6B63;&#x5728;&#x76EF;&#x7740;&#x4ED6;&#x5011;&#x7684;&#x201C;&#x8EAB;&#x4EFD;&#x201D;&#x6216;&#x201C;&#x8072;&#x8B7D;&#x201D;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x4ED6;&#x5011;&#x7684;&#x7D93;&#x6FDF;&#x6301;&#x6709;&#xFF09;&#x3002;&#x9019;&#x7232;&#x9A57;&#x8B49;&#x8005;&#x5275;&#x5EFA;&#x4E86;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x554F;&#x8CAC;&#x5236;&#xFF0C;&#x6700;&#x9069;&#x5408;&#x4F01;&#x696D;&#xFF0C;&#x79C1;&#x6709;&#x6216;&#x6E2C;&#x8A66;&#x7DB2;&#x8DEF;&#x3002;</p>
</div>
<div class="paragraph">
<p>PoA&#x76EE;&#x524D;&#x7531;&#x6E2C;&#x8A66;&#x7DB2;&#x8DEF;Kovan&#xFF08;PoA&#x7DB2;&#x8DEF;&#xFF09;&#x4F7F;&#x7528;&#xFF0C;&#x4E26;&#x4E14;&#x53EF;&#x4EE5;&#x5728;Parity&#x4E2D;&#x8F15;&#x9B06;&#x914D;&#x7F6E;&#x7528;&#x65BC;&#x79C1;&#x4EBA;&#x806F;&#x76DF;&#x7DB2;&#x8DEF;&#x3002;</p>
</div>
</div>
<div class="sect3">
<h4 id="_dpos">DPoS</h4>
<div class="paragraph">
<p>&#x4EE3;&#x7406;&#x6B0A;&#x76CA;&#x8B49;&#x660E;&#xFF08;DPoS&#xFF09;&#x662F;&#x4E00;&#x7A2E;&#x7D93;&#x904E;&#x4FEE;&#x6539;&#x7684;&#x6B0A;&#x76CA;&#x8B49;&#x660E;&#x5F62;&#x5F0F;&#xFF0C;&#x7DB2;&#x8DEF;&#x53C3;&#x8207;&#x8005;&#x6295;&#x7968;&#x9078;&#x8209;&#x4E00;&#x7CFB;&#x5217;&#x4EE3;&#x8868;&#xFF08;&#x4E5F;&#x7A31;&#x7232;&#x8B49;&#x4EBA;&#xFF09;&#x4F86;&#x9A57;&#x8B49;&#x548C;&#x4FDD;&#x8B77;&#x5340;&#x584A;&#x93C8;&#x3002;&#x9019;&#x4E9B;&#x4EE3;&#x8868;&#x6709;&#x9EDE;&#x985E;&#x4F3C;&#x65BC;PoA&#x4E2D;&#x7684;&#x6B0A;&#x5A01;&#x7BC0;&#x9EDE;&#xFF0C;&#x9664;&#x975E;&#x4ED6;&#x5011;&#x7684;&#x6B0A;&#x9650;&#x53EF;&#x80FD;&#x88AB;&#x9078;&#x6C11;&#x64A4;&#x92B7;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x5728;DPoS&#x5171;&#x8B58;&#x4E2D;&#xFF0C;&#x8207;PoS&#x4E00;&#x6A23;&#xFF0C;&#x6295;&#x7968;&#x6B0A;&#x91CD;&#x8207;&#x7528;&#x6236;&#x6CE8;&#x5165;&#x7684;&#x6295;&#x6CE8;&#x91D1;&#x984D;&#x6210;&#x6B63;&#x6BD4;&#x3002;&#x9019;&#x5C31;&#x7522;&#x751F;&#x4E86;&#x4E00;&#x500B;&#x5834;&#x666F;&#xFF0C;&#x5373;&#x8F03;&#x591A;token&#x6301;&#x6709;&#x8005;&#x6BD4;&#x8F03;&#x5C11;token&#x7684;&#x6301;&#x6709;&#x8005;&#x64C1;&#x6709;&#x66F4;&#x591A;&#x7684;&#x6295;&#x7968;&#x6B0A;&#x3002;&#x5F9E;&#x904A;&#x6232;&#x7406;&#x8AD6;&#x7684;&#x89D2;&#x5EA6;&#x4F86;&#x770B;&#xFF0C;&#x9019;&#x662F;&#x6709;&#x9053;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x7232;&#x90A3;&#x4E9B;&#x5177;&#x6709;&#x66F4;&#x591A;&#x7D93;&#x6FDF;&#x7684;&#x201C;&#x904A;&#x6232;&#x4E2D;&#x7684;&#x76AE;&#x819A;&#x201D;&#x7684;&#x4EBA;&#x81EA;&#x7136;&#x6703;&#x6709;&#x66F4;&#x5927;&#x7684;&#x52D5;&#x529B;&#x4F86;&#x9078;&#x51FA;&#x6700;&#x6709;&#x6548;&#x7684;&#x4EE3;&#x8868;&#x8B49;&#x4EBA;&#x3002;</p>
</div>
<div class="paragraph">
<p>&#x6B64;&#x5916;&#xFF0C;&#x4EE3;&#x8868;&#x8B49;&#x4EBA;&#x6703;&#x6536;&#x5230;&#x9A57;&#x8B49;&#x6BCF;&#x500B;&#x5340;&#x584A;&#x7684;&#x734E;&#x52F5;&#xFF0C;&#x56E0;&#x6B64;&#x88AB;&#x6FC0;&#x52F5;&#x4FDD;&#x6301;&#x8AA0;&#x5BE6;&#x548C;&#x6709;&#x6548; - &#x4EE5;&#x514D;&#x88AB;&#x66FF;&#x63DB;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4F7F;&#x201C;&#x8CC4;&#x8CC2;&#x201D;&#x8B8A;&#x5F97;&#x76F8;&#x7576;&#x5408;&#x7406;; &#x4F8B;&#x5982;&#xFF0C;&#x4EA4;&#x6613;&#x6240;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5B58;&#x6B3E;&#x5229;&#x7387;&#xFF08;&#x6216;&#x8005;&#x66F4;&#x52A0;&#x542B;&#x7CCA;&#x5730;&#xFF0C;&#x4F7F;&#x7528;&#x4EA4;&#x6613;&#x6240;&#x81EA;&#x5DF1;&#x7684;&#x8CC7;&#x91D1;&#x5EFA;&#x7ACB;&#x4E00;&#x500B;&#x5F88;&#x597D;&#x7684;&#x754C;&#x9762;&#x548C;&#x529F;&#x80FD;&#xFF09;&#xFF0C;&#x4EA4;&#x6613;&#x6240;&#x904B;&#x71DF;&#x5546;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5927;&#x91CF;&#x5B58;&#x6B3E;&#x9032;&#x884C;DPoS&#x5171;&#x8B58;&#x6295;&#x7968;&#x3002;&#x3002;</p>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="___5">&#x4EE5;&#x592A;&#x574A;&#x7684;&#x5171;&#x8B58;</h2>
<div class="sectionbody">
<div class="sect2">
<h3 id="_ethash">Ethash&#x7C21;&#x4ECB;</h3>
<div class="paragraph">
<p>Ethash&#x662F;&#x4EE5;&#x592A;&#x574A;<strong>&#x5DE5;&#x4F5C;&#x91CF;&#x8B49;&#x660E;&#xFF08;PoW&#xFF09;&#x6F14;&#x7B97;&#x6CD5;</strong>&#xFF0C;&#x5B83;&#x4F9D;&#x8CF4;&#x65BC;&#x6578;&#x64DA;&#x96C6;&#x7684;&#x521D;&#x59CB;&#x7D00;&#x5143;&#x7684;&#x751F;&#x6210;&#xFF0C;&#x8A72;&#x6578;&#x64DA;&#x96C6;&#x7684;&#x5927;&#x5C0F;&#x7D04;&#x7232;1GB&#xFF0C;&#x7A31;&#x7232;&#x6709;&#x5411;&#x7121;&#x74B0;&#x5716;&#xFF08;<strong>DAG</strong>&#xFF09;&#x3002;<strong>DAG</strong>&#x4F7F;&#x7528;* Dagger-Hashimoto&#x6F14;&#x7B97;&#x6CD5;<strong>&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5B83;&#x662F;*Vitalik Buterin&#x7684;Dagger&#x6F14;&#x7B97;&#x6CD5;</strong>&#x548C;<strong>Thaddeus Dryja&#x7684;Hashimoto&#x6F14;&#x7B97;&#x6CD5;</strong>&#x7684;&#x7D44;&#x5408;&#x3002;* Dagger-Hashimoto&#x6F14;&#x7B97;&#x6CD5;<strong>&#x662F;&#x4EE5;&#x592A;&#x574A;1.0&#x4F7F;&#x7528;&#x7684;&#x6316;&#x6398;&#x6F14;&#x7B97;&#x6CD5;&#x3002;&#x96A8;&#x7740;&#x6642;&#x9593;&#x7684;&#x63A8;&#x79FB;&#xFF0C;*DAG</strong>&#x7DDA;&#x6027;&#x589E;&#x9577;&#xFF0C;&#x6BCF;<strong>&#x7D00;&#x5143;</strong>&#xFF08;30,000&#x584A;&#xFF0C;125&#x5C0F;&#x6642;&#xFF09;&#x66F4;&#x65B0;&#x4E00;&#x6B21;&#x3002;</p>
</div>
<div class="sect3">
<h4 id="___6">&#x7A2E;&#x5B50;&#xFF0C;&#x7DE9;&#x5B58;&#xFF0C;&#x6578;&#x64DA;&#x751F;&#x6210;</h4>
<div class="paragraph">
<p><strong>PoW&#x6F14;&#x7B97;&#x6CD5;</strong>&#x6D89;&#x53CA;&#xFF1A;<br>
- &#x901A;&#x904E;&#x6383;&#x63CF;<strong>DAG</strong>&#x7684;&#x5148;&#x524D;&#x584A;&#x982D;&#x4F86;&#x8A08;&#x7B97;&#x6BCF;&#x500B;&#x584A;&#x7684;<strong>Seed</strong>&#x3002;+
- <strong>Cache</strong> &#x662F;&#x4E00;&#x500B;16MB&#x7684;&#x50DE;&#x96A8;&#x6A5F;&#x7DE9;&#x5B58;&#xFF0C;&#x6839;&#x64DA;&#x7A2E;&#x5B50;&#x8A08;&#x7B97;&#xFF0C;&#x7528;&#x65BC;&#x8F15;&#x91CF;&#x7D1A;&#x5BA2;&#x6236;&#x7AEF;&#x4E2D;&#x7684;&#x5132;&#x5B58;&#x3002;<br>
- &#x4F86;&#x81EA;cache&#x7684;<strong>DAG</strong> <strong>Data Generation</strong> &#x5728;&#x5B8C;&#x6574;&#x5BA2;&#x6236;&#x7AEF;&#x548C;&#x7926;&#x5DE5;&#x4E0A;&#x7528;&#x65BC;&#x5132;&#x5B58; (&#x6578;&#x64DA;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9805;&#x53EA;&#x4F9D;&#x8CF4;cache&#x4E2D;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x9805;&#x76EE;&#xFF09;+
- <strong>&#x7926;&#x5DE5;</strong>&#x901A;&#x904E;&#x96A8;&#x6A5F;&#x62BD;&#x53D6;&#x6578;&#x64DA;&#x96C6;&#x7684;&#x7247;&#x6BB5;&#x4E26;&#x5C07;&#x5B83;&#x5011;&#x6DF7;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x9032;&#x884C;&#x6316;&#x6398;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5132;&#x5B58;&#x7684;&#x7DE9;&#x5B58;&#x548C;&#x4F4E;&#x8A18;&#x61B6;&#x9AD4;&#x9032;&#x884C;&#x9A57;&#x8B49;&#xFF0C;&#x4EE5;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x6240;&#x9700;&#x7684;&#x6578;&#x64DA;&#x96C6;&#x7684;&#x7279;&#x5B9A;&#x90E8;&#x5206;&#x3002;</p>
</div>
<div class="ulist">
<div class="title">&#x53C3;&#x8003;&#xFF1A;</div>
<ul>
<li>
<p>Ethash-DAG: <a href="https://github.com/ethereum/wiki/wiki/Ethash-DAG" class="bare" target="_blank">https://github.com/ethereum/wiki/wiki/Ethash-DAG</a></p>
</li>
<li>
<p>Ethash Specification: <a href="https://github.com/ethereum/wiki/wiki/Ethash" class="bare" target="_blank">https://github.com/ethereum/wiki/wiki/Ethash</a></p>
</li>
<li>
<p>Mining Ethash DAG: <a href="https://github.com/ethereum/wiki/wiki/Mining#ethash-dag" class="bare" target="_blank">https://github.com/ethereum/wiki/wiki/Mining#ethash-dag</a></p>
</li>
<li>
<p>Dagger-Hashimoto Algorithm: <a href="https://github.com/ethereum/wiki/blob/master/Dagger-Hashimoto.md" class="bare" target="_blank">https://github.com/ethereum/wiki/blob/master/Dagger-Hashimoto.md</a></p>
</li>
<li>
<p>DAG Explanation and Images: <a href="https://ethereum.stackexchange.com/questions/1993/what-actually-is-a-dag" class="bare" target="_blank">https://ethereum.stackexchange.com/questions/1993/what-actually-is-a-dag</a></p>
</li>
<li>
<p>Ethash in Ethereum Yellowpaper: <a href="https://ethereum.github.io/yellowpaper/paper.pdf#appendix.J" class="bare" target="_blank">https://ethereum.github.io/yellowpaper/paper.pdf#appendix.J</a></p>
</li>
<li>
<p>Ethash C API Example Usage: <a href="https://github.com/ethereum/wiki/wiki/Ethash-C-API" class="bare" target="_blank">https://github.com/ethereum/wiki/wiki/Ethash-C-API</a></p>
</li>
</ul>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_polkadot">Polkadot&#x7C21;&#x4ECB;</h3>
<div class="paragraph">
<p>Polkadot&#x662F;&#x4E00;&#x7A2E;&#x93C8;&#x9593;&#x5340;&#x584A;&#x93C8;&#x5354;&#x8B70;&#xFF0C;&#x5305;&#x62EC;&#x8207;&#x6B0A;&#x76CA;&#x8B49;&#x660E;&#xFF08;PoS&#xFF09;&#x93C8;&#x7684;&#x6574;&#x5408;&#xFF0C;&#x5141;&#x8A31;Parachain&#x5728;&#x6C92;&#x6709;&#x5167;&#x90E8;&#x5171;&#x8B58;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#x7372;&#x5F97;&#x5171;&#x8B58;&#x3002;</p>
</div>
<div class="ulist">
<div class="title">Polkadot&#x5305;&#x62EC;&#xFF1A;</div>
<ul>
<li>
<p><strong>Relay-Chains</strong> &#x9023;&#x63A5;&#x5230;&#x6240;&#x6709;Parachains&#x4E26;&#x5354;&#x8ABF;&#x5340;&#x584A;&#x93C8;&#x4E4B;&#x9593;&#x7684;&#x5171;&#x8B58;&#x548C;&#x4EA4;&#x6613;&#x50B3;&#x905E;&#xFF0C;&#x4E26;&#x4F7F;&#x7528;<strong>&#x9A57;&#x8B49;&#x51FD;&#x6578;</strong>&#x901A;&#x904E;&#x9A57;&#x8B49;PoV&#x5019;&#x9078;&#x584A;&#x7684;&#x6B63;&#x78BA;&#x6027;&#x4F86;&#x4FC3;&#x9032;Parachain&#x4EA4;&#x6613;&#x7684;&#x6700;&#x7D42;&#x78BA;&#x5B9A;&#x3002;</p>
</li>
<li>
<p><strong>Parachains</strong>&#xFF08;&#x8DE8;&#x7DB2;&#x8DEF;&#x7684;&#x4E26;&#x884C;&#x93C8;&#xFF09;&#xFF0C;&#x5B83;&#x5011;&#x662F;&#x5340;&#x584A;&#x93C8;&#xFF0C;&#x7528;&#x65BC;&#x6536;&#x96C6;&#x548C;&#x4E26;&#x884C;&#x8655;&#x7406;&#x4EA4;&#x6613;&#x4EE5;&#x5BE6;&#x73FE;&#x53EF;&#x4F38;&#x7E2E;&#x6027;&#x3002;</p>
</li>
<li>
<p>&#x7121;&#x9700;&#x4FE1;&#x4EFB;&#xFF0C;&#x4EA4;&#x6613;&#x76F4;&#x63A5;&#x5728;&#x5340;&#x584A;&#x93C8;&#x4E4B;&#x9593;&#x8F49;&#x79FB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x904E;&#x4E2D;&#x9593;&#x4EBA;&#x6216;&#x5206;&#x6563;&#x4EA4;&#x6613;&#x6240;&#x3002;</p>
</li>
<li>
<p><strong>&#x5F59;&#x7E3D;&#x5B89;&#x5168;</strong>&#xFF0C;&#x6839;&#x64DA;&#x5171;&#x8B58;&#x5354;&#x8B70;&#x898F;&#x5247;&#xFF08;<strong>Rules</strong>&#xFF09;&#x6AA2;&#x67E5;Parachain&#x4EA4;&#x6613;&#x6709;&#x6548;&#x6027;&#x3002;&#x901A;&#x904E;&#x7D50;&#x5408;&#x7531;&#x52D5;&#x614B;&#x6CBB;&#x7406;&#x7CFB;&#x7D71;&#x78BA;&#x5B9A;&#x7684;&#x6BCF;&#x500B;&#x96C6;&#x5718;&#x6210;&#x54E1;&#x7684;&#x4E00;&#x5B9A;&#x6BD4;&#x4F8B;&#x7684;&#x6B0A;&#x76CA;token&#x8CC7;&#x672C;&#x4F86;&#x5BE6;&#x73FE;&#x5B89;&#x5168;&#x6027;&#x3002;&#x7FA3;&#x7D44;&#x6210;&#x54E1;&#x8CC7;&#x683C;&#x9700;&#x8981;&#x7D81;&#x5B9A;&#x4F86;&#x81EA;Validators&#x548C;Nominators&#x7684;&#x8CED;&#x6CE8;token&#x7684;&#x8F38;&#x5165;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x73FE;&#x4E0D;&#x826F;&#x884C;&#x7232;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x8A66;&#x9A57;&#x4E2D;&#x4F7F;&#x7528;&#x4E0D;&#x7576;&#x884C;&#x7232;&#x8B49;&#x660E;&#x9032;&#x884C;&#x6263;&#x9664;&#x3002;</p>
</li>
<li>
<p><strong>Bridges</strong> &#x901A;&#x904E;&#x89E3;&#x8026;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x5171;&#x8B58;&#x67B6;&#x69CB;&#x6A5F;&#x5236;&#x7684;&#x5340;&#x584A;&#x93C8;&#x7DB2;&#x8DEF;&#x4E4B;&#x9593;&#x7684;&#x93C8;&#x63A5;&#x4F86;&#x63D0;&#x4F9B;&#x53EF;&#x64F4;&#x5C55;&#x6027;&#x3002;</p>
</li>
<li>
<p><strong>Collators</strong> &#x8CA0;&#x8CAC;&#x76E3;&#x7BA1;&#x548C;&#x7DAD;&#x8B77;&#x7279;&#x5B9A;&#x7684;Parachain&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#x5C07;&#x5176;&#x53EF;&#x7528;&#x4EA4;&#x6613;&#x6574;&#x7406;&#x7232;&#x6709;&#x6548;&#x6027;&#x8B49;&#x660E;&#xFF08;PoV&#xFF09;&#x5019;&#x9078;&#x584A;&#xFF0C;&#x5411;Validators&#x5831;&#x544A;&#x4EE5;&#x8B49;&#x660E;&#x4EA4;&#x6613;&#x6709;&#x6548;&#x4E26;&#x5728;&#x584A;&#x4E2D;&#x6B63;&#x78BA;&#x57F7;&#x884C;&#x3002;&#x5982;&#x679C;&#x5B83;&#x6709;winning ticket&#xFF08;&#x7531;&#x6700;&#x63A5;&#x8FD1;Golden Ticket&#x7684;Polkadot&#x5730;&#x5740;&#x7684;Collator&#x7C3D;&#x540D;&#xFF09;&#x4E26;&#x4E14;&#x8B8A;&#x5F97;&#x898F;&#x7BC4;&#x548C;&#x6700;&#x7D42;&#x78BA;&#x5B9A;&#xFF0C;&#x5247;&#x901A;&#x904E;&#x652F;&#x4ED8;&#x4ED6;&#x5011;&#x5F9E;&#x5275;&#x5EFA;PoV&#x5019;&#x9078;&#x5340;&#x584A;&#x6240;&#x6536;&#x96C6;&#x7684;&#x4EFB;&#x4F55;&#x4EA4;&#x6613;&#x8CBB;&#x4F86;&#x6FC0;&#x52F5;&#x4ED6;&#x5011;&#x3002;Collators&#x88AB;&#x7D66;&#x4E88;Polkadot&#x5730;&#x5740;&#x3002;&#x81A0;&#x5408;&#x5291;&#x4E0D;&#x8207;&#x925A;&#x63A5;&#x6A19;&#x8A18;&#x7C98;&#x5408;&#x3002;</p>
</li>
<li>
<p><strong>Golden Ticket</strong>&#x662F;&#x5305;&#x542B;&#x734E;&#x52F5;&#x7684;&#x6BCF;&#x500B;Parachain&#x7684;&#x6BCF;&#x500B;&#x5340;&#x584A;&#x4E2D;&#x7684;&#x7279;&#x5B9A;Polkadot&#x5730;&#x5740;&#x3002;Collators&#x88AB;&#x8CE6;&#x4E88;&#x4E00;&#x500B;Polkadot&#x5730;&#x5740;&#xFF0C;&#x4E26;&#x5411;Validator&#x63D0;&#x4F9B;&#x7531;Collator&#x7C3D;&#x540D;&#x7684;PoV&#x5019;&#x9078;&#x584A;&#x3002;&#x734E;&#x52F5;&#x7684;&#x7372;&#x734E;&#x8005;&#x5728;PoV&#x5019;&#x9078;&#x5340;&#x584A;&#x4E2D;&#x6709;&#x4E00;&#x500B;Collator Polkadot&#x5730;&#x5740;&#xFF0C;&#x8A72;&#x5340;&#x57DF;&#x6700;&#x63A5;&#x8FD1;Golden Ticket Polkadot&#x5730;&#x5740;</p>
</li>
<li>
<p><strong>Fisherman</strong> &#x76E3;&#x63A7;Polkadot&#x7DB2;&#x8DEF;&#x4EA4;&#x6613;&#xFF0C;&#x4EE5;&#x767C;&#x73FE;Polkadot&#x793E;&#x5340;&#x7684;&#x4E0D;&#x826F;&#x884C;&#x7232;&#x3002;&#x5C07;&#x9A57;&#x8B49;&#x8005;&#x5E36;&#x5230;&#x6CD5;&#x5EAD;&#x4E26;&#x8B49;&#x660E;&#x4ED6;&#x5011;&#x8868;&#x73FE;&#x5F97;&#x5F88;&#x7CDF;&#x7CD5;&#x7684;Fisherman&#x6703;&#x88AB;&#x78BA;&#x8A8D;&#x8005;&#x7684;&#x50B5;&#x5238;&#x6FC0;&#x52F5;&#xFF0C;&#x56E0;&#x7232;&#x50B5;&#x5238;&#x88AB;&#x7528;&#x4F5C;&#x61F2;&#x7F70;&#x4E0D;&#x826F;&#x884C;&#x7232;&#x7684;&#x61F2;&#x7F70;&#x3002;</p>
</li>
<li>
<p><strong>&#x9A57;&#x8B49;&#x8005;</strong> &#x662F;Parachain&#x793E;&#x5340;&#x4E2D;&#x7684;&#x7DAD;&#x8B77;&#x8005;&#xFF0C;&#x4ED6;&#x5011;&#x88AB;&#x90E8;&#x7F72;&#x5230;&#x4E0D;&#x540C;&#x7684;Parachains&#x4F86;&#x76E3;&#x7BA1;&#x7CFB;&#x7D71;&#x3002;&#x9A57;&#x8B49;&#x8005;&#x540C;&#x610F;Merkle Trees&#x7684;&#x6839;&#x6E90;&#x3002;&#x9A57;&#x8B49;&#x8005;&#x5FC5;&#x9808;&#x4F7F;&#x4EA4;&#x6613;&#x53EF;&#x7528;&#x3002;&#x6F01;&#x6C11;&#x53EF;&#x4EE5;&#x5C07;&#x9A57;&#x8B49;&#x54E1;&#x5E36;&#x5230;&#x6CD5;&#x5EAD;&#xFF0C;&#x56E0;&#x7232;&#x6C92;&#x6709;&#x9032;&#x884C;&#x4EA4;&#x6613;&#xFF0C;&#x76F8;&#x95DC;&#x7684;Collat&#x200B;&#x200B;ors&#x53EF;&#x80FD;&#x6703;&#x8CEA;&#x7591;&#x8A72;&#x4EA4;&#x6613;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x4F5C;&#x7232;&#x6574;&#x7406;&#x8B49;&#x660E;&#x3002;</p>
</li>
<li>
<p><strong>&#x63D0;&#x540D;&#x8005;</strong>&#xFF08;&#x985E;&#x4F3C;&#x65BC;PoW&#x6316;&#x6398;&#xFF09;&#x88AB;&#x52D5;&#x76E3;&#x7763;&#x4E26;&#x6295;&#x7968;&#x7D66;&#x4ED6;&#x5011;&#x8A8D;&#x7232;&#x53EF;&#x4EE5;&#x901A;&#x904E;&#x8CED;&#x6CE8;&#x4EE3;&#x5E63;&#x8CC7;&#x52A9;&#x4ED6;&#x5011;&#x8A8D;&#x53EF;&#x7684;&#x78BA;&#x8A8D;&#x8005;&#x3002;</p>
</li>
</ul>
</div>
<div class="paragraph">
<p>Polkadot&#x7684;Relay-Chains&#x4F7F;&#x7528;<strong>Proof of Stake&#xFF08;PoS</strong>&#x7CFB;&#x7D71;&#xFF0C;&#x5176;&#x4E2D;&#x7D50;&#x69CB;&#x5316;&#x72C0;&#x614B;&#x6A5F;&#xFF08;SM&#xFF09;&#x4E26;&#x884C;&#x57F7;&#x884C;&#x591A;&#x500B;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x932F;&#xFF08;BFT&#xFF09;&#x5171;&#x8B58;&#xFF0C;&#x4EE5;&#x4FBF;SM&#x904E;&#x7A0B;&#x6536;&#x6582;&#x4E8E;&#x8D8A;&#x591A;&#x500B;Parachain&#x7DAD;&#x5EA6;&#x7684;&#x5305;&#x542B;&#x6709;&#x6548;&#x5019;&#x9078;&#x8005;&#x7684;&#x89E3;&#x6C7A;&#x65B9;&#x6848;&#x8DE8;&#x7684;&#x584A;&#x3002;&#x6BCF;&#x500B;Parachain&#x4E2D;&#x7684;&#x6709;&#x6548;&#x5019;&#x9078;&#x584A;&#x662F;&#x6839;&#x64DA;&#x4EA4;&#x6613;&#x7684;&#x53EF;&#x7528;&#x6027;&#x548C;&#x6709;&#x6548;&#x6027;&#x78BA;&#x5B9A;&#x7684;&#xFF0C;&#x56E0;&#x7232;&#x6839;&#x64DA;&#x5171;&#x8B58;&#x6A5F;&#x5236;&#xFF0C;&#x76EE;&#x6A19;&#x9A57;&#x8B49;&#x8005;&#xFF08;&#x4E0B;&#x4E00;&#x500B;&#x584A;&#xFF09;&#x53EA;&#x6709;&#x5728;&#x5177;&#x6709;&#x8DB3;&#x5920;&#x7684;&#x4EA4;&#x6613;&#x8CC7;&#x8A0A;&#x6642;&#x624D;&#x80FD;&#x5F9E;&#x6E90;&#x9A57;&#x8B49;&#x8005;&#xFF08;&#x524D;&#x4E00;&#x500B;&#x584A;&#xFF09;&#x57F7;&#x884C;&#x50B3;&#x5165;&#x6D88;&#x606F;&#x3002;&#x53EF;&#x7528;&#x548C;&#x6709;&#x6548;&#x3002;&#x9A57;&#x8B49;&#x4EBA;&#x6295;&#x7968;&#x9078;&#x64C7;Collators&#x4F7F;&#x7528;&#x898F;&#x5247;&#x9054;&#x6210;&#x5171;&#x8B58;&#x7684;&#x6709;&#x6548;&#x5019;&#x9078;&#x5340;&#x584A;&#x3002;</p>
</div>
<div class="ulist">
<div class="title">&#x53C3;&#x8003;</div>
<ul>
<li>
<p>Polkadot link: <a href="https://polkadot.network" class="bare" target="_blank">https://polkadot.network</a></p>
</li>
<li>
<p>Polkadot presentation at Berlin Parity Ethereum link: <a href="https://www.youtube.com/watch?v=gbXEcNTgNco" class="bare" target="_blank">https://www.youtube.com/watch?v=gbXEcNTgNco</a></p>
</li>
</ul>
</div>
</div>
</div>
</div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="14.html" class="navigation navigation-prev " aria-label="Previous page: 第14章 以太坊虛擬機">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="16.html" class="navigation navigation-next " aria-label="Next page: 第16章 Vyper: 面向合約的程式語言">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第15章 共識","level":"1.18","depth":1,"next":{"title":"第16章 Vyper: 面向合約的程式語言","level":"1.19","depth":1,"path":"16.asciidoc","ref":"16.asciidoc","articles":[]},"previous":{"title":"第14章 以太坊虛擬機","level":"1.17","depth":1,"path":"14.asciidoc","ref":"14.asciidoc","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["mathjax","livereload"],"pluginsConfig":{"mathjax":{"forceSVG":false,"version":"2.6-latest"},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"15.asciidoc","mtime":"2019-09-08T04:17:05.903Z","type":"asciidoc"},"gitbook":{"version":"3.2.3","time":"2019-09-08T04:22:42.249Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

